{
    "<s>": 0,
    "<pad>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<mask>": 4,
    "C": 5,
    "N": 6,
    "(": 7,
    "c": 8,
    "1": 9,
    ")": 10,
    "=": 11,
    "O": 12,
    "[NH+]": 13,
    "[NH2+]": 14,
    "2": 15,
    "[O-]": 16,
    "n": 17,
    "3": 18,
    "#": 19,
    "F": 20,
    "[nH]": 21,
    "Br": 22,
    "S": 23,
    "Cl": 24,
    "s": 25,
    "o": 26,
    "4": 27,
    "[N-]": 28,
    "[NH3+]": 29,
    "[N+]": 30,
    "[S-]": 31,
    "B": 32,
    "P": 33,
    "5": 34,
    "6": 35,
    "I": 36,
    "[nH+]": 37,
    "-": 38,
    "[Si]": 39,
    "[se]": 40,
    "[B-]": 41,
    "[n+]": 42,
    "[P+]": 43,
    "[n-]": 44,
    "7": 45,
    "8": 46,
    "9": 47,
    "[Se]": 48,
    "[C-]": 49,
    "[Sn]": 50,
    "p": 51,
    "[CH]": 52,
    "[s+]": 53,
    "%10": 54,
    "[SH]": 55,
    "[Po]": 56,
    "[C+]": 57,
    "[Se-]": 58,
    "[S+]": 59,
    "%11": 60,
    "%12": 61,
    "%13": 62,
    "[CH2-]": 63,
    "[I-]": 64,
    "[IH3]": 65,
    "[Pt-]": 66,
    "[SiH3]": 67,
    "[SiH]": 68,
    "[O+]": 69,
    "[Te]": 70,
    "[CH2]": 71,
    "[Ge]": 72,
    "[Hg]": 73,
    "[SiH2]": 74,
    "[o+]": 75,
    "[BH2-]": 76,
    "[I+]": 77,
    "[GeH2]": 78,
    "[Ga]": 79,
    "[As]": 80,
    "[SeH]": 81,
    "[Hg+]": 82,
    "[c+]": 83,
    "[c-]": 84,
    "%14": 85,
    "%15": 86,
    "%16": 87,
    "%17": 88,
    "%18": 89,
    "%19": 90,
    "%20": 91,
    "%21": 92,
    "%22": 93,
    "%23": 94,
    "%24": 95,
    "%25": 96,
    "%26": 97,
    "%27": 98,
    "%28": 99,
    "%29": 100,
    "%30": 101,
    "%31": 102,
    "%32": 103,
    "%33": 104,
    "%34": 105,
    "%35": 106,
    "%36": 107,
    "%37": 108,
    "%38": 109,
    "%39": 110,
    "%40": 111,
    "[Cl+3]": 112,
    "[At]": 113,
    "[As+]": 114,
    "[Pt]": 115,
    "[Pb]": 116,
    "[Sb]": 117,
    "[PH+]": 118,
    "[te]": 119,
    "[Zr]": 120,
    "[IH2]": 121,
    "[Al]": 122,
    "[CH-]": 123,
    "[pH]": 124,
    "[PbH]": 125,
    "[W]": 126,
    "[PH2+]": 127,
    "[Bi]": 128,
    "[In]": 129,
    "[Ru]": 130,
    "[p+]": 131,
    "[BH3-]": 132,
    "[Tl]": 133,
    "cc": 134,
    "CC": 135,
    "C(": 136,
    "c1": 137,
    "O)": 138,
    "(C": 139,
    "c(": 140,
    "c2": 141,
    "C)": 142,
    "=O)": 143,
    "ccc": 144,
    "c1cc": 145,
    "cccc": 146,
    ")cc": 147,
    "1CC": 148,
    "C(=O)": 149,
    "(C)": 150,
    "c3": 151,
    "F)": 152,
    "2)": 153,
    "CCCC": 154,
    ")C": 155,
    "1C": 156,
    "C1": 157,
    "(=O)": 158,
    "cc(": 159,
    "CCC": 160,
    "CO": 161,
    "C(C)": 162,
    "ccc(": 163,
    "CC(": 164,
    "OCC": 165,
    "c1ccc(": 166,
    "C2": 167,
    ")CC": 168,
    "3)": 169,
    "C(=O)N": 170,
    "N(": 171,
    "2CC": 172,
    "c1cccc": 173,
    "NC(=O)": 174,
    ")c1": 175,
    "Cl)": 176,
    "c2cccc": 177,
    "cn": 178,
    "=C(": 179,
    "OC": 180,
    ")c": 181,
    ")n": 182,
    "n1": 183,
    "c2cc": 184,
    "c1n": 185,
    "nc(": 186,
    "ccccc": 187,
    "c(N": 188,
    "(CC": 189,
    "N)": 190,
    "c4": 191,
    "CC1": 192,
    ")cc1": 193,
    "[O-])": 194,
    "1)": 195,
    "C(C": 196,
    "CN": 197,
    "C1CC": 198,
    "nn": 199,
    ")N": 200,
    "c1cc(": 201,
    "S(=O)": 202,
    "CCO": 203,
    "(=O)N": 204,
    "OC)": 205,
    "(F)": 206,
    "c2ccc(": 207,
    "c1ccccc1": 208,
    "c2)": 209,
    "F)cc": 210,
    "ccc(C": 211,
    "c2n": 212,
    "=C": 213,
    "n2": 214,
    "c(C": 215,
    "c2ccccc2": 216,
    "2)cc": 217,
    "c1ccc": 218,
    "C(F)": 219,
    "c1C": 220,
    "NC(": 221,
    "ccc1": 222,
    "(C)C)": 223,
    "ccc3": 224,
    "Cc1cc": 225,
    "Cc1": 226,
    "=CC": 227,
    "1CO": 228,
    "c1CC": 229,
    "C(=": 230,
    "Cl)cc": 231,
    "CC(C)": 232,
    "c1cccc(": 233,
    "O=": 234,
    "OC(=O)": 235,
    "C(=O)[O-]": 236,
    "C3": 237,
    "c1)": 238,
    "cc1": 239,
    "1O": 240,
    "CC(=O)": 241,
    "c(C)": 242,
    "c2c(": 243,
    "CCN": 244,
    "NC": 245,
    "C(C)(C)": 246,
    "CC2": 247,
    "O=C(": 248,
    "=O": 249,
    "C(=O)C": 250,
    "C(O)": 251,
    "CC1CC": 252,
    "3CC": 253,
    "(=O)[O-]": 254,
    "c3ccccc": 255,
    "c3ccc(": 256,
    "2C": 257,
    ")cc2": 258,
    "c2cc(": 259,
    "S(=O)(=O)": 260,
    "CCC(": 261,
    "c(=O)": 262,
    "C(N": 263,
    "OC(": 264,
    "c2ccc": 265,
    "N1CC": 266,
    "C(C)C)": 267,
    "C(CC": 268,
    "2)c1": 269,
    "CCCCCCCC": 270,
    "nc": 271,
    "C(F)(F)": 272,
    "NCC": 273,
    "(C)CC": 274,
    "nc2": 275,
    "3)cc": 276,
    ")cc1CC": 277,
    "N2": 278,
    "Br)": 279,
    "N(C(=O)": 280,
    "[NH3+])": 281,
    ")c(": 282,
    "4)": 283,
    "2CCCC": 284,
    "C=": 285,
    "2)n": 286,
    "(C)(C)": 287,
    "1CCCC": 288,
    "ncc": 289,
    "c(F)": 290,
    "(N": 291,
    "OC(C)": 292,
    "[NH+]1CC": 293,
    "nc1": 294,
    "1CC(C)": 295,
    "C[NH+]": 296,
    "=N": 297,
    "NC(=O)C": 298,
    "c1c(": 299,
    "c5": 300,
    "C1C": 301,
    "c1ccc(C": 302,
    "#N": 303,
    "N(C)": 304,
    "(O)": 305,
    "C)cc": 306,
    "c3cc": 307,
    ")cc1C": 308,
    "N(CC": 309,
    "cs": 310,
    "[NH2+]CC": 311,
    "[N+](=O)": 312,
    "c3cccc": 313,
    "cc2": 314,
    "S(=O)(=O)N": 315,
    "c2cccc(": 316,
    "CCCCC": 317,
    "CC(=O)N": 318,
    "1CCC(": 319,
    "Cl)c1": 320,
    "CC[NH+]": 321,
    "3)C": 322,
    ")cc(": 323,
    "c1cn": 324,
    "CC1C": 325,
    "Cc1ccc(": 326,
    "c1ccc(N": 327,
    "c3ccccc3": 328,
    "C(=O)O": 329,
    "1CCC": 330,
    "3)CC": 331,
    ")cc2)": 332,
    "c2c1": 333,
    "N1": 334,
    "C2CC": 335,
    "=S": 336,
    "ccccc4": 337,
    ")C1CC": 338,
    "n3": 339,
    "(C)C": 340,
    "c1cc(C": 341,
    "C(C)(C)C)": 342,
    ")ccc1": 343,
    "n1CC": 344,
    "NC(=O)N": 345,
    "C[NH2+]": 346,
    "C(=O)[O-])": 347,
    "[NH2+]C": 348,
    "Br)cc": 349,
    "C2)": 350,
    "C(N)": 351,
    "F)c(": 352,
    "c1c": 353,
    "c1ccccc1)": 354,
    "CC(O)": 355,
    "n2)": 356,
    "COC(=O)": 357,
    ")C2": 358,
    "=O)cc": 359,
    "c3ccc": 360,
    "ccccc2": 361,
    "CC)": 362,
    "[N+](=O)[O-]": 363,
    "[NH+](C)": 364,
    "=[NH+]": 365,
    "c2ccccc2)": 366,
    "n(": 367,
    "Cl)c(": 368,
    "[NH+](C": 369,
    "ccccc3": 370,
    "Oc1ccc(": 371,
    "1CC(": 372,
    "COc1ccc(": 373,
    "c1ccc2": 374,
    "C(=O)N1CC": 375,
    "2)CC": 376,
    "CC2)": 377,
    "OCO": 378,
    "C(F)(F)F)": 379,
    "CCCO": 380,
    "#N)": 381,
    ")C1": 382,
    "c1nc(": 383,
    "2)cc1": 384,
    "1CCO": 385,
    "1C(=O)": 386,
    "c1cc2": 387,
    "N(C": 388,
    "c2nc(": 389,
    "[NH+](CC": 390,
    "CS": 391,
    "F)cc1": 392,
    "3)n": 393,
    "c2cn": 394,
    "C(C(=O)N": 395,
    "c(Cl)": 396,
    "C1=": 397,
    "c3cc(": 398,
    "Cl)cc1": 399,
    "=C(N": 400,
    "OCCO": 401,
    "C(=O)C(": 402,
    "(C)c1": 403,
    "c3ccccc3)": 404,
    "O)cc": 405,
    "2CCC": 406,
    "n1C": 407,
    "N#": 408,
    "CCC1": 409,
    "c3)": 410,
    "c1CO": 411,
    "3CCCC": 412,
    ")c2": 413,
    "c3n": 414,
    "c1ccc2c(": 415,
    ")C(=O)": 416,
    "c4ccccc": 417,
    "c1N": 418,
    "ccn": 419,
    "1Cc1ccc(": 420,
    ")cc3": 421,
    "cccc(": 422,
    "c2ccc3": 423,
    "F)c1": 424,
    "C(=O)NCC": 425,
    "cccc1": 426,
    "(C)c(": 427,
    "1CCN(": 428,
    "c2ccc(C": 429,
    "OCCC": 430,
    "2)cc1CC": 431,
    "NC(=O)C(": 432,
    "c(OC)": 433,
    "c1O": 434,
    "s2)": 435,
    "c4ccc(": 436,
    "3)c2": 437,
    "nc(N": 438,
    "CC(C": 439,
    "nc3": 440,
    "c1cccc(C": 441,
    "S(C)": 442,
    "1COc1ccc(": 443,
    "=OCC": 444,
    "CCCCCC": 445,
    "C(=O)NC": 446,
    "c2ccc(F)cc": 447,
    "c3c(": 448,
    ")ccc2": 449,
    "OC2": 450,
    "Nc1n": 451,
    "SCC": 452,
    "C(C)CC": 453,
    "c1ccc(NC(=O)": 454,
    "(=O)=O)": 455,
    "(O": 456,
    "Oc1cc": 457,
    "c(c2": 458,
    "[NH+]2CC": 459,
    "=C(C)": 460,
    "cc(C": 461,
    "OC)cc": 462,
    "ccc4": 463,
    "c2ccc(Cl)cc": 464,
    "C(C)=O)": 465,
    "C(=O)N2CC": 466,
    ")CC2)": 467,
    "Br)c1": 468,
    "O=C(N": 469,
    "cccn": 470,
    "2)cc1C": 471,
    "1O=C(": 472,
    "C(CO)": 473,
    "c6": 474,
    "C(NC(=O)": 475,
    "c1nn": 476,
    "c1cccc2": 477,
    "Cl)c2": 478,
    "c1ccc(C(=O)N": 479,
    "C(=O)OCC": 480,
    "1CC1": 481,
    "n(C)": 482,
    "c2s": 483,
    "Nc1ccc(": 484,
    "C(=O)NC(": 485,
    "cccc2": 486,
    "1N": 487,
    "=OC": 488,
    "C4": 489,
    "C1(": 490,
    "c4ccccc4": 491,
    "=C2": 492,
    "(C(=O)N": 493,
    "[NH+](": 494,
    "OCCCC": 495,
    "(Cl)": 496,
    "NC(=O)C(C)": 497,
    "N2CC": 498,
    "c[nH]": 499,
    "N)=O)": 500,
    "CCC2": 501,
    "O)C": 502,
    ")cc1)": 503,
    "sc(": 504,
    "NC(=O)C2": 505,
    "c(S": 506,
    "CCC1CC": 507,
    "C(F)(F)F)cc": 508,
    "C(=O)N(": 509,
    "[NH3+])C": 510,
    "4CC": 511,
    "o2)": 512,
    "c12": 513,
    "2CCC(": 514,
    "CN(": 515,
    "c2)c1": 516,
    "CC3": 517,
    "C(C)C(=O)N": 518,
    "OCC(=O)N": 519,
    "1COC(=O)": 520,
    "SC": 521,
    "2CO": 522,
    "c2C)": 523,
    "CC(F)": 524,
    "[nH]c(": 525,
    "NS(=O)(=O)": 526,
    "ccc2": 527,
    "cc3": 528,
    "4)cc": 529,
    "CCCN": 530,
    "CC(C)(C)": 531,
    "C2CCCC": 532,
    "CCOC(=O)": 533,
    "c2)CC": 534,
    "([O-])": 535,
    "c1ccc(O": 536,
    "OC1": 537,
    "(CO)": 538,
    "(C)cc": 539,
    "NC(=O)CC": 540,
    "c1cc(N": 541,
    "=C(C": 542,
    "(C(=O)": 543,
    "CC[NH2+]": 544,
    "P(=O)": 545,
    "(F)F)": 546,
    ")cc3)": 547,
    "ccccc5": 548,
    "c1ccccc1C": 549,
    "Cc1n": 550,
    "s1CC": 551,
    "c2)n": 552,
    "C([NH3+]": 553,
    "c2ccccc1": 554,
    "2)C1": 555,
    "2)c(": 556,
    "OC(C)(C)C)": 557,
    "NC(=O)C1CC": 558,
    "c(C(=O)N": 559,
    "n(C": 560,
    "ncn": 561,
    "Cn1": 562,
    "C(O": 563,
    "[NH2+]C(": 564,
    "OCCOCC": 565,
    "CCC3": 566,
    "[N+](=O)[O-])": 567,
    "OC)c(": 568,
    "C)CC": 569,
    "4)n": 570,
    "sc1": 571,
    "C1)": 572,
    "Cc1cc(": 573,
    "=CCC": 574,
    "s1C": 575,
    "#C": 576,
    "[NH2+]C(C)": 577,
    "Cc1cccc(": 578,
    "oc(": 579,
    "c(O": 580,
    "c1ccc(Br": 581,
    "c1cc(C)": 582,
    ")C(": 583,
    ")N1CC": 584,
    "CCC(C)": 585,
    "no": 586,
    "CCOCC": 587,
    "1Cc1n": 588,
    "(CC(=O)N": 589,
    "[NH3+])CC": 590,
    "c2ccc(N": 591,
    "c2cc3": 592,
    "CCC[NH2+]": 593,
    "CCC1C": 594,
    "c3ccc(C": 595,
    "c(O)": 596,
    "c3cccc(": 597,
    "n1c(": 598,
    "2CCN(": 599,
    "4)CC": 600,
    "c2nn": 601,
    "=C1": 602,
    "c1nnc(": 603,
    "C=CC": 604,
    "C(N)=O)": 605,
    "[NH+]=C(": 606,
    "1C[NH2+]": 607,
    "c1cc(F)cc": 608,
    "CCC[NH+]": 609,
    "NC(=O)c1ccc(": 610,
    "1)C": 611,
    "c1cc(C(=O)N": 612,
    "c2ccccc2)n": 613,
    ")c4": 614,
    "C(F)(F)F": 615,
    "[O-])C": 616,
    "(C)O": 617,
    "1Cc1cc": 618,
    "CCC(=O)N": 619,
    "c1Cl": 620,
    "c3ccc(F)cc": 621,
    "(C2": 622,
    "S)": 623,
    "c1cc(Cl)cc": 624,
    "1Cc1cc(": 625,
    "2CCOCC": 626,
    "c1s": 627,
    "=CCCC": 628,
    "c3ccc(Cl)cc": 629,
    "C(C)C": 630,
    "c1ccc2c(c1)": 631,
    "s1)": 632,
    "2)CC1": 633,
    "c(N)n": 634,
    "[NH2+]C1CC": 635,
    "2)ccc1": 636,
    "n4": 637,
    "#CC": 638,
    "OC)c1": 639,
    "s1": 640,
    "4c(": 641,
    "OC1CC": 642,
    "c1nc(N": 643,
    "CCNC(=O)": 644,
    "C(=O)CC": 645,
    "c(C)c1": 646,
    "2)CC1CC": 647,
    ")C(=O)N": 648,
    "c(c2)": 649,
    ")CC1CC": 650,
    "sc2": 651,
    "Br)cc1": 652,
    "n1cc(": 653,
    "Cc1ccccc1": 654,
    "[nH]c2": 655,
    "C3CC": 656,
    "(CCCC": 657,
    "(C)c2": 658,
    "c2cc(C": 659,
    "c2ccccc2)c1": 660,
    "OC(=O)N": 661,
    "NN": 662,
    "2)C1CC": 663,
    "3)C2": 664,
    "C(=O)OC)": 665,
    "c2[nH]": 666,
    "N=": 667,
    "2)c1C": 668,
    "2)s": 669,
    "n1n": 670,
    "2=O)": 671,
    "c3cn": 672,
    "o1CC": 673,
    "1COCC": 674,
    "4)C": 675,
    "c2ccccc2)CC": 676,
    "c1[nH]": 677,
    "c1ccc(Cl)cc1": 678,
    "=CC(=O)": 679,
    "c1ccc(C2": 680,
    "F)c(F)": 681,
    "[NH+](C)C)": 682,
    "S(": 683,
    "(C)n": 684,
    "c(=O)[nH]": 685,
    ")C1C": 686,
    "(C)C)cc": 687,
    "N=C": 688,
    "[nH]c1": 689,
    "OCC1": 690,
    "2)c1CC": 691,
    "Sc1n": 692,
    "1Cc1": 693,
    "N(S(=O)(=O)": 694,
    "Cl)CC": 695,
    "c(C)cc": 696,
    "c3)n": 697,
    "O=C([O-]": 698,
    "C(=S": 699,
    "c1F": 700,
    "c1nc(C": 701,
    "N2C(=O)": 702,
    "c1cccc(Cl)c1": 703,
    "c1ccc(F)cc1": 704,
    "C(=O)NC2": 705,
    "3C": 706,
    "NC(=O)CO": 707,
    "CN(C)": 708,
    "OC3": 709,
    "c3c2": 710,
    "NC(=S": 711,
    "C2=O)": 712,
    "csc(": 713,
    "n1cn": 714,
    ")cc4": 715,
    "3)cc2)": 716,
    "1)N": 717,
    "CCCC(C)": 718,
    "1CN(": 719,
    "C(=O)NC(C": 720,
    "C1(C)": 721,
    ")cc1Cl": 722,
    "c(CC": 723,
    "CNC(=O)": 724,
    "N(C(=O)N": 725,
    "CCC4": 726,
    "C1O": 727,
    "C(O)C(O)": 728,
    "1CCOC(=O)": 729,
    "1C=CC": 730,
    ")c1ccc(": 731,
    "c2=O)": 732,
    ")c(C)": 733,
    "C)c1": 734,
    "OCc1ccccc1": 735,
    "S(=O)(=O)c1ccc(": 736,
    "c2ncn": 737,
    "N3": 738,
    "2C)": 739,
    "C(=O)N2": 740,
    "C(F)(F)C(F)(F)": 741,
    "n1)": 742,
    "c2c(c1)": 743,
    "O=C1": 744,
    "CN1": 745,
    "1(C)": 746,
    "5)": 747,
    "C(=O)N(C)": 748,
    "c4ccc": 749,
    "c(NC(=O)": 750,
    "C(=O)Nc1ccc(": 751,
    "o1C": 752,
    "[Si](C)(C)": 753,
    "CCOc1ccc(": 754,
    "nc(C": 755,
    "c1ccc(F)cc": 756,
    "c2ccc(Br": 757,
    "c1cs": 758,
    "CCS": 759,
    "(CC)": 760,
    "N1C(=O)": 761,
    "C#": 762,
    "4)c3": 763,
    "(CCC": 764,
    "c(c3": 765,
    "C([NH3+])": 766,
    "O)c(": 767,
    "c2)cc1": 768,
    "c1cc(Br": 769,
    "CC1)": 770,
    "c2cccc3": 771,
    "c1ncn": 772,
    "cc1C": 773,
    ")cc1F": 774,
    "o1)": 775,
    "c2cccc(F)": 776,
    "2)C": 777,
    "C(C)C)cc": 778,
    "cccc3": 779,
    "c1ccn": 780,
    "[N+](=O)[O-])c1": 781,
    "C(=O)Nc2ccc(": 782,
    "C(=O)NC(C)": 783,
    ")(": 784,
    "CCCC(": 785,
    "c2nnc(": 786,
    "Cl)cc(": 787,
    "ccccc6": 788,
    "[O-])c1": 789,
    "c1c(C)": 790,
    "C=C": 791,
    "[nH]c(=O)": 792,
    "c2c": 793,
    "c2cc(Cl)cc": 794,
    "(C)C(=O)": 795,
    "O=C([O-])": 796,
    "c7": 797,
    "SCC(=O)N": 798,
    "=C(O)": 799,
    "O)c1": 800,
    "CC(CC": 801,
    "C(=O)C2": 802,
    "COCC": 803,
    "3)cc2": 804,
    "N)n": 805,
    "cnc(N": 806,
    "1C=": 807,
    ")CC1": 808,
    "1COc1cc(": 809,
    "N(C(=O)C": 810,
    "n1cc": 811,
    "CCCCCCCCCCCC": 812,
    "n(CC": 813,
    "CC(=O)[O-])": 814,
    "2CC2)": 815,
    "NC(=O)C(C": 816,
    "COc1ccccc1": 817,
    "cn1CC": 818,
    "c3ccc4": 819,
    "=CC(": 820,
    "Cc1cn": 821,
    ")O": 822,
    "1CS": 823,
    "Cl)C": 824,
    "Cc1ccc(C": 825,
    "CCCC2": 826,
    "cc(N": 827,
    "c1ccco": 828,
    "CC(=O)[O-]": 829,
    "c(Cl)c1": 830,
    "c1cc2c(": 831,
    "cn2": 832,
    "3CCC": 833,
    "c(C)n": 834,
    "OC(C)=O)": 835,
    "3CCOCC": 836,
    "cc(C(=O)N": 837,
    "C(C)(": 838,
    "cnn": 839,
    "c4cc(": 840,
    "=CC(=O)N": 841,
    "c1cccnc1": 842,
    "ccc5": 843,
    "c1ccccc1CO": 844,
    "F)cc2": 845,
    "C(=O)NC1CC": 846,
    "S(C)(=O)=O)": 847,
    "OC(C": 848,
    "1CN": 849,
    "c1ccccc1)N": 850,
    "=OCO": 851,
    "(=O)[O-])": 852,
    "c1CC(C)": 853,
    "CCCCCCCCCCCCCCCC": 854,
    "[Si](C)": 855,
    "CC(NC(=O)": 856,
    "c2cccnc2": 857,
    "2c(": 858,
    "CCCC1": 859,
    "C(CC)": 860,
    "CC1(": 861,
    "O=S(=O)": 862,
    "C(=O)OC": 863,
    "c2c(C)": 864,
    "[NH+](C)CC": 865,
    "c1ncc": 866,
    "CCN(": 867,
    "OCC2)": 868,
    "C(=O)N(CC": 869,
    "C(=C": 870,
    "(OC)": 871,
    "(=O)N1CC": 872,
    "cc2)": 873,
    "1CCCCCC": 874,
    "NC(=O)CS": 875,
    "COc1cc(": 876,
    "cn1C": 877,
    "N(CC(=O)N": 878,
    "C(=O)N(C": 879,
    "2c1": 880,
    "c1ccc(Cl)": 881,
    "Oc2ccc(": 882,
    "c1no": 883,
    "C(=O)[O-])C": 884,
    "c1ccc(S(=O)(=O)N": 885,
    "c2cc(F)cc": 886,
    "O2)": 887,
    "C(=O)[O-])c1": 888,
    "c1ccc(C)": 889,
    "C(=O)[O-])CC": 890,
    "2)CC1C": 891,
    ")cc1CO": 892,
    "o1": 893,
    "C2CCC": 894,
    "O[Si]": 895,
    "C1(C": 896,
    "c1ccc(OC)": 897,
    "2)cc1CO": 898,
    "3C)": 899,
    "c1ccc2c(c1": 900,
    "COc1ccc(C": 901,
    "c1c(C": 902,
    "3)CC2)": 903,
    "c4cccc": 904,
    "c(C)c(": 905,
    "oc1": 906,
    "2CC(C)": 907,
    "c1ccc(Cl)cc": 908,
    "1COc1ccc(C": 909,
    "c1ccccc1CC": 910,
    "2)n1CC": 911,
    "2)cn": 912,
    "CO)": 913,
    "OCC(C)": 914,
    "C2(": 915,
    "c5ccccc5": 916,
    "N(C)C(=O)": 917,
    "1CCC(C)": 918,
    ")cc1O=C(": 919,
    "O=C(C": 920,
    "C1=O": 921,
    "Cl)cc2": 922,
    "F)cc(": 923,
    "OCC1CC": 924,
    "(CO": 925,
    ")c1n": 926,
    "OC)c(OC)": 927,
    "NC1CC": 928,
    "c2ncc": 929,
    "=S)": 930,
    "S(C)(=O)": 931,
    "1CCCCC1": 932,
    "CN1C(=O)": 933,
    "Cl)n": 934,
    "Nc1cc(": 935,
    "=C1C": 936,
    "3)ccc2": 937,
    "OC(C)(C)": 938,
    ")C3": 939,
    "c2ccncc": 940,
    "c3ccccc2": 941,
    "c2ccccc2)C": 942,
    "1CC(C)(C)": 943,
    "C1CO": 944,
    "n2cn": 945,
    "c1cccc(N": 946,
    "NC(=O)c2ccc(": 947,
    "[NH+]2CCCC": 948,
    "CCCNC(=O)": 949,
    "c1ncc(": 950,
    "3)n2": 951,
    "OCC(": 952,
    "OC(F)": 953,
    "(NC(=O)": 954,
    "cnc(": 955,
    "c[nH+]": 956,
    "c1ccc(Cl)c(": 957,
    "c(F)c1": 958,
    "Oc1ccccc1": 959,
    "c2ccc(F)cc2)": 960,
    "1O=": 961,
    "c2o": 962,
    "ccc(C)cc": 963,
    "c2ccc(C(=O)N": 964,
    "SC)": 965,
    "NC(C)": 966,
    "Br)c(": 967,
    "2C(": 968,
    ")n1": 969,
    "CCCCC2": 970,
    "co": 971,
    "oc(C": 972,
    "2CC3": 973,
    "=O)c1": 974,
    "CC(N": 975,
    "1CC(=O)": 976,
    "[NH+]1CCN(": 977,
    "1CC1CC": 978,
    "C(OC": 979,
    "n1c(=O)": 980,
    "C(C)NC(=O)": 981,
    "CO=C(": 982,
    "c2ccc(OC)": 983,
    "1C[NH+]": 984,
    "2CC(": 985,
    "2)n1C": 986,
    "1(": 987,
    "=[NH2+]": 988,
    "N2CCCC": 989,
    "c2cccc(Cl)c2": 990,
    "cnc2": 991,
    "c2ccc(O": 992,
    "C(F)F)": 993,
    "c1cccc(NC(=O)": 994,
    "C(=O)C(C)": 995,
    "c1ccccc1F": 996,
    "[NH2+]C2": 997,
    "C(C(=O)": 998,
    "(C(F)(F)F)": 999,
    "(CN": 1000,
    "C(=O)C1": 1001,
    "c3nc(": 1002,
    "C5": 1003,
    "=O)cc1": 1004,
    "c2ccccc2)cc1": 1005,
    "c2nc(C": 1006,
    "C(C)(C)CC": 1007,
    "ncc(": 1008,
    "CC1(C)": 1009,
    "Nc1cc": 1010,
    "C(CO": 1011,
    "c3ccccc3)cc": 1012,
    ")CC1C": 1013,
    "N(CC)": 1014,
    "c2ccc(Cl)cc2": 1015,
    "(C#N)": 1016,
    "=Cc1ccc(": 1017,
    "c1CCCC": 1018,
    "c1cccs": 1019,
    "(C)C(": 1020,
    "2(": 1021,
    "C1CC(": 1022,
    "c2ncc(": 1023,
    "c2nc3ccccc3": 1024,
    "P(=O)([O-])": 1025,
    "ccccc1": 1026,
    "C2(CC": 1027,
    "c2ccccc2c1": 1028,
    "c(c4": 1029,
    "1O=C(N": 1030,
    "CCCC2)": 1031,
    "4CCCC": 1032,
    "c2ccccc2F)": 1033,
    ")c1cn": 1034,
    "c1ccc(OCC": 1035,
    "CCn1": 1036,
    "c2cs": 1037,
    "OCc1ccc(": 1038,
    "c2ccc(Cl)cc2)": 1039,
    "c1ccc(O)": 1040,
    "=C([O-])": 1041,
    "c2ccc3c(c2)": 1042,
    "3)c1": 1043,
    "c5ccc(": 1044,
    "C(=O)c1ccc(": 1045,
    "CN(C": 1046,
    "(C)c(C)": 1047,
    "1)N1CC": 1048,
    "NC(=O)c1cc(": 1049,
    "cn2)": 1050,
    "c3)CC": 1051,
    "CCC=": 1052,
    "c2cc(C)": 1053,
    "C(C#N)": 1054,
    "1COc1ccccc1": 1055,
    "1COc1cccc(": 1056,
    "OCC(=O)": 1057,
    "C(CC(C)C)": 1058,
    "[NH3+])c1": 1059,
    "c2F)": 1060,
    "2)c1CO": 1061,
    "OCC)": 1062,
    "C#N": 1063,
    "c4c(": 1064,
    "nn2": 1065,
    "2)n1": 1066,
    "N(c2ccc(": 1067,
    ")c(C": 1068,
    "COc1cccc(": 1069,
    "N=C(": 1070,
    "c1o": 1071,
    "c1ccc(n2": 1072,
    "c3s": 1073,
    "c2cc(N": 1074,
    "cn1": 1075,
    "[NH2+]CC1": 1076,
    "CCc1ccc(": 1077,
    "C(C)N": 1078,
    "CCCn1": 1079,
    "C(C)O": 1080,
    ")c3": 1081,
    "c4)": 1082,
    "3)c(": 1083,
    "c1c[nH]": 1084,
    "cc(C)": 1085,
    "c1ccccc1Cl": 1086,
    ")c1ccccc1": 1087,
    "c4cc": 1088,
    "O=C1CC": 1089,
    "2)C1C": 1090,
    "OC(CO)": 1091,
    "s3)": 1092,
    "CC4": 1093,
    "CCCCC2)": 1094,
    "c1c(N": 1095,
    "c2ccccc2n": 1096,
    "SC1": 1097,
    "c1ccc(c2": 1098,
    "c1ccccc1)c1ccccc1": 1099,
    "c1ccc(C)c(": 1100,
    "1CCCC(": 1101,
    "=[N+]": 1102,
    "c(F)c(F)": 1103,
    "Cc2": 1104,
    "nc(S": 1105,
    "=C)": 1106,
    "CC([NH3+])": 1107,
    "(C)CCC": 1108,
    "(c1ccccc1)": 1109,
    "c2ccc(F)cc2": 1110,
    "CCCS": 1111,
    "I)": 1112,
    "C(C)(C)C)cc": 1113,
    "CC3)": 1114,
    "c2ccc(Cl)c(": 1115,
    "C(=O)N2CCCC": 1116,
    "N)c1": 1117,
    "3)nc2": 1118,
    "nc(C)": 1119,
    "C1CCN(": 1120,
    "[nH]c3": 1121,
    "CCCCO": 1122,
    "C[NH+]1CC": 1123,
    "c2n1CC": 1124,
    "1Cn1": 1125,
    "NC(=O)C[NH+]": 1126,
    "N(CCC": 1127,
    "OCC2": 1128,
    "c2)cc1CC": 1129,
    "C(O)C": 1130,
    "1Cc1ccccc1": 1131,
    ")C2)": 1132,
    "CN1CC": 1133,
    "c2ccc([N+](=O)[O-]": 1134,
    "[NH2+]CC1CC": 1135,
    "C1CCC(": 1136,
    "c1cccc(C(=O)N": 1137,
    "NC(=O)c1cccc(": 1138,
    "c(=O)n": 1139,
    "2C(=O)": 1140,
    "CCN1": 1141,
    "1C2": 1142,
    "c(N)": 1143,
    "2)cc(": 1144,
    "c2cccs2)": 1145,
    "2CCCCC2": 1146,
    "[NH2+]C)": 1147,
    "NC(=O)CN": 1148,
    "c2c(F)": 1149,
    "CN(C(=O)": 1150,
    "2)o": 1151,
    "2O": 1152,
    "C(C)C(": 1153,
    "c4ccccc4)": 1154,
    "cnc1": 1155,
    "COc1cc": 1156,
    "cnc3": 1157,
    "Oc2ccccc2": 1158,
    "C1=C(": 1159,
    "c1c(Cl)": 1160,
    "=CC=CC": 1161,
    "c2)C": 1162,
    "3CCCCC3": 1163,
    "O)CC": 1164,
    "=C1CC": 1165,
    "OCc2ccccc2": 1166,
    "c1CCC": 1167,
    "c1c(F)": 1168,
    "c2cccs": 1169,
    "c1ccc(O)cc": 1170,
    "c2ccc(Cl)": 1171,
    "C(=O)C1CC": 1172,
    "1CC[NH2+]": 1173,
    "c1cccc(C)c1": 1174,
    "c1cncc(": 1175,
    "NC(N": 1176,
    "C(=O)[O-])n": 1177,
    "c2ccco": 1178,
    "CC(F)(F)": 1179,
    "c2)cc": 1180,
    "C(O)C1": 1181,
    "[NH+](CC(=O)N": 1182,
    "nnc1": 1183,
    "[NH2+]CCC": 1184,
    "ncc1": 1185,
    "n2c(": 1186,
    ")c5": 1187,
    "c1cccn": 1188,
    "n3)": 1189,
    "CC(C)C)": 1190,
    "c3ccc(N": 1191,
    "O=C": 1192,
    "ncc2": 1193,
    "[N+](=O)[O-])cc1": 1194,
    "Br)cn": 1195,
    "3)cc1": 1196,
    "n[nH]": 1197,
    "1CCCC1": 1198,
    "3)cn": 1199,
    "#N)c1": 1200,
    "C3)": 1201,
    "S1": 1202,
    "C1=OC": 1203,
    "=C3": 1204,
    "oc2": 1205,
    "1C1CC": 1206,
    "c1OCC": 1207,
    "2)nc1": 1208,
    "c1cc(OC)": 1209,
    "c12CC": 1210,
    "O)cc1": 1211,
    "3c2": 1212,
    "[NH2+]C(C": 1213,
    "C(Cc1ccc(": 1214,
    "c1cccc(F)": 1215,
    "COC": 1216,
    "5)cc": 1217,
    "[NH2+]CC2": 1218,
    "FCO": 1219,
    "C1CC1": 1220,
    "c(C)c1CC": 1221,
    "O1CC": 1222,
    "C2CC2)": 1223,
    "Cc2ccccc2": 1224,
    "3)o": 1225,
    "CC(N)": 1226,
    "C(N)=[NH+]": 1227,
    "CC(F)(F)F)": 1228,
    "sc3": 1229,
    "c2c1CC": 1230,
    "NC(=S)N": 1231,
    "O=[N+]": 1232,
    "c1cccc(F)c1": 1233,
    "C(F)(F)F)cc1": 1234,
    "c1ccccc1N": 1235,
    "c(N)c1": 1236,
    "Sc2n": 1237,
    "NC(N)": 1238,
    ")CC2": 1239,
    "C3CCCC": 1240,
    "c2c(c1": 1241,
    "c2ccccn2)": 1242,
    "CC(N)=O)": 1243,
    "c3ccc4c(": 1244,
    "c2cccc(C": 1245,
    "(C#N": 1246,
    "1CC(=O)N": 1247,
    "(C)(C)O": 1248,
    "n2cc": 1249,
    "CCCN(": 1250,
    "c1ccccc1NC(=O)": 1251,
    "Br)C": 1252,
    "C(Cc1ccccc1)": 1253,
    "=O)N": 1254,
    "Cl)cn": 1255,
    "-2": 1256,
    "1Cc1cccc(": 1257,
    "c2ccc(C)": 1258,
    "[NH3+])C(=O)N": 1259,
    "C1=O)": 1260,
    "1)c1": 1261,
    "c(=O)n2": 1262,
    "C)cc1": 1263,
    "c2cc(C(=O)N": 1264,
    "(C)C3": 1265,
    "C(=N": 1266,
    ")c1ccc": 1267,
    "c(N2CC": 1268,
    "n2)cc1CC": 1269,
    "2CCN(C(=O)": 1270,
    "C(Cl)": 1271,
    "[NH+]1CCC(": 1272,
    "c1ccccc1)C": 1273,
    "OC(C)C)": 1274,
    "c1Cc1ccc(": 1275,
    "C(=O)CS": 1276,
    "(C[NH2+]": 1277,
    "C(=S)N": 1278,
    "C(C)(C": 1279,
    "[nH]2)": 1280,
    "S(=O)(=O)N1CC": 1281,
    "CC[NH+](": 1282,
    "n1c(C": 1283,
    "[nH]1CC": 1284,
    "c3ccccc3)C": 1285,
    "NC(=O)C3": 1286,
    "Br)n": 1287,
    "(C)CCCC": 1288,
    "c(C)c(C)": 1289,
    "=CN": 1290,
    "Cl)c3": 1291,
    "=CC1": 1292,
    "ccccc7": 1293,
    "o3)": 1294,
    "(OCC": 1295,
    "C(CCCC": 1296,
    "1[NH3+]": 1297,
    "C(N)=S": 1298,
    "C(C)CCCC": 1299,
    ")cc1OCC": 1300,
    ")c1ccc(C": 1301,
    "(C(C)C)": 1302,
    "cc4": 1303,
    "n1O=C(": 1304,
    "C1=OCC": 1305,
    "n1nc(": 1306,
    "FCC": 1307,
    "[NH+]1CCOCC": 1308,
    "1CCCO": 1309,
    "S(N)": 1310,
    "c1ccncc": 1311,
    "c1ccc(C)cc1": 1312,
    "c4ccc(F)cc": 1313,
    "c4cccc(": 1314,
    "c8": 1315,
    "S(=O)(=O)[O-]": 1316,
    "Cc1c(": 1317,
    "C1O=C(": 1318,
    "[NH+]3CC": 1319,
    "c2cccc(C)": 1320,
    "c1cnc(": 1321,
    "CCCCC3)": 1322,
    "CCCCC1": 1323,
    "NC(=O)c1ccccc1": 1324,
    ")cs": 1325,
    "3c(": 1326,
    ")CC3)": 1327,
    "C1C(": 1328,
    "C2C": 1329,
    "C(C)(C)O": 1330,
    "(C)(=O)": 1331,
    "c2ccc(NC(=O)": 1332,
    "NC(=O)OC(C)(C)C)": 1333,
    "cc(Cl)": 1334,
    "OC(CO": 1335,
    "1)C(=O)N": 1336,
    "c3cccc4": 1337,
    "C)n": 1338,
    "c1ccc(S": 1339,
    "n2cc(": 1340,
    "c3cccs": 1341,
    "C1CCCCC1": 1342,
    "Cl)ccc2": 1343,
    "c3C)": 1344,
    "c1ccc([N+](=O)[O-]": 1345,
    "OC1C": 1346,
    "[NH+]=C(N": 1347,
    "c1cccc(Br)c1": 1348,
    "3)s": 1349,
    "c1ccc(N2CC": 1350,
    "c1ccc(F)": 1351,
    "NC2": 1352,
    "ClCO": 1353,
    "1COc1cc(C": 1354,
    "C1N": 1355,
    "C(F)(F)F)c1": 1356,
    "CCCOC(=O)": 1357,
    "c2ccccc21CC": 1358,
    "CCN1C(=O)": 1359,
    "(=O)=O)cc": 1360,
    "c1ccc(N2": 1361,
    "c2ccc(OC)cc": 1362,
    "Br)c2": 1363,
    "c2ccccc12)": 1364,
    "O)C(": 1365,
    "c2ccccc2)cc1CC": 1366,
    "c3nn": 1367,
    "[NH+]=C(N)": 1368,
    "c3ccccc3)CC": 1369,
    "=CC2": 1370,
    "2O=C(": 1371,
    "CCCC[NH3+])": 1372,
    "c23)": 1373,
    "c6ccccc6": 1374,
    "SC2": 1375,
    "n1c(S": 1376,
    "=O)cc1CC": 1377,
    "C(=O)[O-])cc": 1378,
    ")cc1N": 1379,
    "C(O)C2": 1380,
    ")cc5": 1381,
    "c1ccnc(": 1382,
    "c1ccccc1O": 1383,
    "c1cc(Cl)": 1384,
    "NC(=O)c2cc(": 1385,
    "OCC(C": 1386,
    "CCCC3": 1387,
    "2CCCC2": 1388,
    "c2cccc(C(F)(F)F)": 1389,
    "CCCC(=O)N": 1390,
    "c2ccccc2)C1": 1391,
    "c2ccco2)": 1392,
    "c12)": 1393,
    "P(": 1394,
    "2CCCCC2)": 1395,
    "(C)c3": 1396,
    "CCO)": 1397,
    "c1nc2ccccc2": 1398,
    "C(C)CO": 1399,
    "C(OC(=O)": 1400,
    "C[NH+](C)": 1401,
    "C12CC": 1402,
    "c(OC)c1": 1403,
    "C1CCC2": 1404,
    "=OO=C(": 1405,
    "c2cc1": 1406,
    "c1cc(NC(=O)": 1407,
    "c3cccc(Cl)": 1408,
    "c3)C2": 1409,
    "=C=C": 1410,
    "c(C2": 1411,
    "NC1": 1412,
    "c2ccccc2-": 1413,
    "(c2ccccc2)": 1414,
    "NC(=[NH+]": 1415,
    "CC(CC(C": 1416,
    ")cc2)cc1": 1417,
    "c1ccc(OC": 1418,
    "c2ccccc12": 1419,
    "c3ccc(c4": 1420,
    "3)C1": 1421,
    "c3cccnc3": 1422,
    "C(F)F": 1423,
    "c1cccc(O": 1424,
    "ClCC": 1425,
    "CC2)cc1": 1426,
    "3)n2)": 1427,
    "CCCCCCCCCC": 1428,
    "SC(": 1429,
    "c2cc(Br)cc": 1430,
    "=CCO": 1431,
    "(=O)N(": 1432,
    "c2c(Cl)": 1433,
    "C(=O)NC(CC": 1434,
    "[NH3+])n": 1435,
    "OCCCO": 1436,
    "NC(=O)C[NH+]1CC": 1437,
    "C(=O)N1": 1438,
    "CC1O=C(": 1439,
    "(C2CC": 1440,
    "Br)cc2": 1441,
    "3CCN(": 1442,
    "C(OC)": 1443,
    "c1ccc(CC": 1444,
    "c1ccccc1F)": 1445,
    "c(C)nn": 1446,
    "N#Cc1ccc(": 1447,
    "C(C)O)": 1448,
    "c3ccccn": 1449,
    "(C(=O)[O-])": 1450,
    "N(C(=O)OC(C)(C)C)": 1451,
    "[nH]1)": 1452,
    "nc4": 1453,
    "c2ccc(C)cc2)": 1454,
    "C(C(=O)[O-])": 1455,
    "c(CO": 1456,
    "O=C(CC": 1457,
    "CC[NH+](CC": 1458,
    "c1ccc(Br)": 1459,
    "c1cc(C)c(": 1460,
    "C(=O)C=C": 1461,
    "c3ccco": 1462,
    ")CCO": 1463,
    "C(=O)CO": 1464,
    "N(CC)C(=O)": 1465,
    "n2nc(": 1466,
    "O=C(NC": 1467,
    "=C(C#N)": 1468,
    "CC(C(=O)N": 1469,
    "OCC(O)": 1470,
    "n2)cc1": 1471,
    "c1cc(Cl)ccc1": 1472,
    "S(=O)(=O)c2ccc(": 1473,
    "(C3": 1474,
    "c1ccc(F)c(": 1475,
    "(CC)CC": 1476,
    "c2cccc(Br)": 1477,
    "3CC3)": 1478,
    "(CNC(=O)": 1479,
    "CC(O": 1480,
    "C(C)(C)C": 1481,
    "3CCCC3": 1482,
    "cccc4": 1483,
    "C2O)": 1484,
    "nn1": 1485,
    "S(=O)(=O)N2CC": 1486,
    "NC(=O)C=C": 1487,
    "CCCC(=O)": 1488,
    "c3ccccc3F)": 1489,
    "c2c(C": 1490,
    "3CCC(": 1491,
    "c4n": 1492,
    "[NH+]1CCC(C(=O)N": 1493,
    "c1cccc(C)": 1494,
    "[Si](": 1495,
    "3)nn": 1496,
    "(C)C2": 1497,
    "c2ccs": 1498,
    ")nc(": 1499,
    "2CCC3": 1500,
    "c(NC": 1501,
    "c1ccc2nc(": 1502,
    "1)c1ccccc1": 1503,
    "Cc1cc(C": 1504,
    "1CC(C": 1505,
    "4)ccc3": 1506,
    "CCCC1CC": 1507,
    "n1nn": 1508,
    "Cl)c2)": 1509,
    "(C[NH3+])": 1510,
    "2)c(C)": 1511,
    "c3cccc(F)": 1512,
    "nn(": 1513,
    ")cc2C)": 1514,
    "C([NH2+]": 1515,
    "c2cc3c(": 1516,
    "CCOc1ccccc1": 1517,
    "NC(=O)C1": 1518,
    "N(c2n": 1519,
    "c(C)c1C": 1520,
    "n1)N": 1521,
    "(=O)O": 1522,
    "c3ccccc32)": 1523,
    "[N+](=O)[O-])cc": 1524,
    "c2nc(N": 1525,
    "C[NH+](C": 1526,
    "c2cc(Cl)ccc2": 1527,
    "CCCO)": 1528,
    "c1ccc(c2n": 1529,
    "c(C(=O)": 1530,
    "c2ccccc2)cc1C": 1531,
    "c2c[nH]": 1532,
    "3)C2)": 1533,
    "c1cc2c(cc1": 1534,
    "1CCC[NH2+]": 1535,
    "c2c(=O)": 1536,
    "Br)c": 1537,
    "c1cc(F)ccc1": 1538,
    "2)N": 1539,
    "O1C": 1540,
    "c2ccc(O)": 1541,
    "[O-])CC": 1542,
    "1CN(C(=O)": 1543,
    "n5": 1544,
    "c1ccc(C(=O)": 1545,
    "C(=O)NCCC": 1546,
    "C(C)(O)": 1547,
    "C(=O)OCC(=O)N": 1548,
    "cc1Cl": 1549,
    "N(CCO)": 1550,
    "OC4": 1551,
    "CC1CO": 1552,
    "=C2S": 1553,
    "ccc6": 1554,
    "[O-])c(": 1555,
    "c2ccc3ccccc3": 1556,
    "Cl)ccc3": 1557,
    "CC(O)CO": 1558,
    "([NH3+])": 1559,
    "c1nc2c(": 1560,
    "c2nc3": 1561,
    "c2ccccc2Cl)": 1562,
    "O=C([O-])C": 1563,
    "c2ccc(C(F)(F)F)cc": 1564,
    "c4ccc5": 1565,
    "c2c1C": 1566,
    "c1ccc(Br)cc1": 1567,
    "c2ccc3c(c2": 1568,
    "C(=O)C3": 1569,
    "2)cc1CC(C)": 1570,
    "(C)C1CC": 1571,
    "c2)cc1C": 1572,
    "c1ccc2n": 1573,
    "3CC4": 1574,
    "CCCCCCC": 1575,
    "c3ccncc": 1576,
    "c(C3": 1577,
    "FC": 1578,
    "on": 1579,
    "CCOc1ccc(C": 1580,
    "=O)n": 1581,
    "F)ccc1": 1582,
    "2CCC(C(=O)N": 1583,
    "Br)cc(": 1584,
    "S(=O)(=O)c1ccccc1": 1585,
    "N1C": 1586,
    "=NNC(=O)": 1587,
    "c1nc(C)": 1588,
    "Cl)c(Cl)c1": 1589,
    "C(=O)N1CCCC1": 1590,
    "5CC": 1591,
    "c1cccs1)": 1592,
    ")cc1Br": 1593,
    "c(C2CC": 1594,
    "CCC(=O)": 1595,
    "C=C(": 1596,
    "CC2CC": 1597,
    "C1CC(C)": 1598,
    "2)no": 1599,
    "C(O)(": 1600,
    "Cl)ccc1": 1601,
    "c3cc4": 1602,
    "S(=O)(=O)C": 1603,
    "4CCCCC": 1604,
    "c1cccc2c1": 1605,
    "[NH2+]C1": 1606,
    "(F)F": 1607,
    "c1ccc(c2ccc(": 1608,
    "c(Br)c1": 1609,
    "c3ccc(Br)cc": 1610,
    "Oc1ccc(C": 1611,
    "cc(F)": 1612,
    "CCOC)": 1613,
    "c1ccc2c(c1)OCO": 1614,
    "Cl)c(Cl)": 1615,
    "c1)N": 1616,
    "[NH3+]CC": 1617,
    "c3ccc(Cl)cc3": 1618,
    "#N)cc": 1619,
    "c1cc(=O)": 1620,
    "C2CCCCC2": 1621,
    "C(C[NH3+])": 1622,
    "CC(C)(O)": 1623,
    "c3cc(C)": 1624,
    "c1CCO": 1625,
    "CCN1CC": 1626,
    "C2)cc1": 1627,
    "4)cc3": 1628,
    "O=C(NCC": 1629,
    "nn1CC": 1630,
    "Cl)s": 1631,
    "CC1(C": 1632,
    "c1=O)": 1633,
    "c1cccc(C2": 1634,
    "I)c1": 1635,
    "2CCO": 1636,
    "n2c(=O)": 1637,
    "n2)cc1C": 1638,
    "C(=O)NC3": 1639,
    "c1ccc2ccccc2": 1640,
    "2N": 1641,
    "c21CC": 1642,
    "1CCCC1C": 1643,
    "OCCOC(=O)": 1644,
    "C1CCC": 1645,
    ")N(C": 1646,
    "c1[nH+]": 1647,
    "cncn": 1648,
    "CC[NH+](C": 1649,
    "c3c(C)": 1650,
    "c3ccc(Cl)c(": 1651,
    "C(=O)[O-])cc1": 1652,
    "c1cc(C)ccc1": 1653,
    "C(C)C)cc1": 1654,
    "C1CCCC1": 1655,
    "=CCC=CCC": 1656,
    "(C[NH+]": 1657,
    "c1cnc(N": 1658,
    "CCCOc1ccc(": 1659,
    "N(CC1CC": 1660,
    "C3=O)": 1661,
    "c(C#N)": 1662,
    "[NH2+]CCN": 1663,
    "N)c(": 1664,
    "c1CCC(C)": 1665,
    "c2ccc(Br)cc2": 1666,
    "cc1CC": 1667,
    "5)n": 1668,
    "c2ccccc2C)": 1669,
    "4CCOCC": 1670,
    "=O)CC": 1671,
    "(CC(=O)": 1672,
    "c3ccc(Cl)cc3)": 1673,
    "n2C)": 1674,
    "CCC2)": 1675,
    "FC(F)(F)": 1676,
    "1N#": 1677,
    "c1nn(": 1678,
    "c1cc(Br)ccc1": 1679,
    "(N)": 1680,
    "NC(=O)c1cn": 1681,
    "c1=O": 1682,
    "1C#": 1683,
    "c2ncccc2": 1684,
    "nnc(": 1685,
    "2)c1O=C(": 1686,
    "nc5": 1687,
    "F)cc1C": 1688,
    "5)c": 1689,
    "CC1CC(C)": 1690,
    "[NH2+]Cc1ccc(": 1691,
    "c4ccc(C": 1692,
    "sc2c1": 1693,
    "COc1cc(C": 1694,
    "(CCO)": 1695,
    "c1ccc(C(": 1696,
    "1)C1CC": 1697,
    "CC1)N": 1698,
    "NC(=O)C2CC[NH+]": 1699,
    "c(F)cccc1": 1700,
    "c3ccc(F)cc3)": 1701,
    "c2c(N": 1702,
    "5c(": 1703,
    "(C)CC(=O)N": 1704,
    "OCc1ccccc1)": 1705,
    "Oc1cc(": 1706,
    "C12": 1707,
    "n2n": 1708,
    "1)C(=O)[O-]": 1709,
    "ClC": 1710,
    "CCN(C)": 1711,
    "C(OC(C)=O)": 1712,
    "c1cc([N+](=O)[O-]": 1713,
    "C[NH+](CC": 1714,
    "[NH+](C)C": 1715,
    "N(C(=O)C2": 1716,
    "Cl)cc3": 1717,
    "oc3": 1718,
    "OCC1)": 1719,
    "c1csc(": 1720,
    "[NH+](CC)CC": 1721,
    "c3ccc(C(=O)N": 1722,
    "(c3ccccc3)": 1723,
    "=O)cc1C": 1724,
    "C(=O)OC(C)": 1725,
    "c1nnc(C": 1726,
    "1CCCCC": 1727,
    "c4c3": 1728,
    "OC)cc(": 1729,
    "=NN": 1730,
    "C(C)CCC": 1731,
    "C([NH3+])C": 1732,
    "C(=O)N1CCC(": 1733,
    "n1CO": 1734,
    "cc(OC)": 1735,
    "OC(=O)CCCCCCCC": 1736,
    "c2ccccc2O": 1737,
    "NCC(=O)N": 1738,
    "c3ccc(OC)cc": 1739,
    "c1nn(C)": 1740,
    "C(=S)": 1741,
    "C(=O)OC(C)(C)": 1742,
    "=[N-]": 1743,
    "[nH]1C": 1744,
    "Cl)cc1Cl": 1745,
    "NC(=O)C(CC": 1746,
    "C(=O)N3CC": 1747,
    "CC1CCCO": 1748,
    "c1ccccn1": 1749,
    "[NH+]2CCC(C(=O)N": 1750,
    "O)C(O)": 1751,
    "c3ncc": 1752,
    "4)c(": 1753,
    "[NH+]3": 1754,
    "c2ccc(OCC": 1755,
    "c2N": 1756,
    "F)cc1CC": 1757,
    "NC(=O)COC(=O)": 1758,
    "C(CCC": 1759,
    "1CC1(C)": 1760,
    "n1cc(C": 1761,
    "C2C3": 1762,
    "CC(C)(C)C)": 1763,
    "c4ccc(Cl)cc": 1764,
    "SC(=": 1765,
    "c1nn(C": 1766,
    "[NH2+]C2CC": 1767,
    "c1cccc(C(F)(F)F)": 1768,
    "C(=O)c1ccccc1": 1769,
    "CC1(O)": 1770,
    "C1CCN(C(=O)": 1771,
    "O)cc(": 1772,
    "c1ccc(C#N": 1773,
    "C(=O)Nc2ccccc2": 1774,
    "CCC)": 1775,
    "c(C)cc(C": 1776,
    "s1CO": 1777,
    "c3)CC2)": 1778,
    "(C)(C)C)": 1779,
    "C(c2ccccc2)": 1780,
    "3(": 1781,
    "C([O-])": 1782,
    "1)C(=O)": 1783,
    "c2)c(": 1784,
    ")C(C)": 1785,
    "C2CC[NH+]": 1786,
    "c1ccccc1Cl)": 1787,
    "c2cccc(C(=O)N": 1788,
    "c4cn": 1789,
    "=O)[nH]": 1790,
    "2CC(=O)": 1791,
    "=CC(C)": 1792,
    "Cl)cc1CC": 1793,
    "CNS(=O)(=O)": 1794,
    "C(C)C(C)": 1795,
    "C2(C)": 1796,
    "c2ccc(C)cc2": 1797,
    "c3[nH]": 1798,
    "4)cc3)": 1799,
    "OCCOCCOCCOCC": 1800,
    "Cl)cc1C": 1801,
    "(C(": 1802,
    "3)C2=O)": 1803,
    "NC(=O)OC": 1804,
    "c1ccsc1": 1805,
    "P(=O)(": 1806,
    "[NH2+]Cc1": 1807,
    "F)CC": 1808,
    "[NH3+])N": 1809,
    "c1cc(C)cc(": 1810,
    "[NH2+]CC(O)": 1811,
    "=Cc2ccc(": 1812,
    "[Si](C)(C)C)": 1813,
    "C(=O)C(=C": 1814,
    "c2ccc(S(=O)(=O)N": 1815,
    "c3ccc(C)cc3)": 1816,
    "c2ccccc21C": 1817,
    "2C=CC": 1818,
    "c2ccc(Br)cc2)": 1819,
    "1CN(C)": 1820,
    "2CCCC2)": 1821,
    "5)CC": 1822,
    "C1=CC": 1823,
    "c2csc(": 1824,
    "N(C(=O)CC": 1825,
    "S(=O)(=O)c1ccc(C": 1826,
    "[NH2+]CC(C)": 1827,
    "c1sc(": 1828,
    "cn1)": 1829,
    "c1cc2ccccc2": 1830,
    "C2)n": 1831,
    ")c(F)": 1832,
    ")n1CC": 1833,
    "Nc1nc(": 1834,
    "C1)N": 1835,
    "2)N1CC": 1836,
    "c2ccccc21)": 1837,
    "[NH+]1CCN(C(=O)": 1838,
    "CCC(CC": 1839,
    "(Cl)c1": 1840,
    "c3ccc(O": 1841,
    "F)cc3": 1842,
    "1)CC": 1843,
    "(C(=O)[O-]": 1844,
    "cnc4": 1845,
    "CC(C)O": 1846,
    "c1ccccc1O=C(": 1847,
    "c3)C": 1848,
    "C(=O)N(C)C)": 1849,
    "c2ccccc2C1": 1850,
    "C1=C(C)": 1851,
    "c(=O)c2": 1852,
    "C(OC2": 1853,
    "[nH]c(C": 1854,
    "C(=O)NCC(=O)N": 1855,
    "c(F)c2": 1856,
    "[NH3+]C1CC": 1857,
    "CN2": 1858,
    "c1cc(F)c(": 1859,
    "Nc1ccccc1": 1860,
    "c1cnc[nH]": 1861,
    "OCC1C": 1862,
    "c1ccc(S(=O)(=O)": 1863,
    "(C(C)": 1864,
    "2CC[NH+](C": 1865,
    "[nH+]c(": 1866,
    "3(CC": 1867,
    "c1ccccc1Br": 1868,
    "cccc1Cl": 1869,
    "c2sc(": 1870,
    "C(CC(=O)N": 1871,
    "C(=O)c2ccccc2": 1872,
    "CCN(C": 1873,
    "c2nc3c(": 1874,
    "c2ccc(C#N": 1875,
    ")c6": 1876,
    "c3ccccc3)CC2)": 1877,
    "(F)(F)": 1878,
    "Nc1cccc(": 1879,
    "nc1C": 1880,
    "C(=O)OC(": 1881,
    "CCCCC1CC": 1882,
    "C(=C)": 1883,
    "C(=O)[O-]CO": 1884,
    "C(=O)OC(C)(C)C)": 1885,
    "c1cc(C=N": 1886,
    "S(=O)(=O)CC": 1887,
    "c1ccccc1CC(C)": 1888,
    "-3": 1889,
    "c2ccc(O)cc": 1890,
    "o2)cc1": 1891,
    "c1ccccc1C(=O)N": 1892,
    "c1ccc2[nH]": 1893,
    "c(C(F)(F)F)": 1894,
    "O=C(NC1CC": 1895,
    "c1ncccc1": 1896,
    "c(SCC(=O)N": 1897,
    "N(c3ccc(": 1898,
    "c2ccc(OC": 1899,
    "nn3": 1900,
    "c4ccccc4)n": 1901,
    "n2)c1": 1902,
    "C(=O)Nc1cccc(": 1903,
    "CCC2CC": 1904,
    "c2ccccc2)N": 1905,
    "c1ccc(OC)cc": 1906,
    ")NC(=O)": 1907,
    "c1cc(Br)": 1908,
    "c2cc3ccccc3": 1909,
    "[Si](C)(C)C(C)(C)C)": 1910,
    "c1cc(Cl)c(": 1911,
    "c2ccc3c(c2)OCO": 1912,
    "OCCC(C)": 1913,
    ")cc2)cc": 1914,
    "c1ccs": 1915,
    "[NH+]2": 1916,
    "c1ccco1)": 1917,
    "2CCOC(=O)": 1918,
    ")c(C)c1": 1919,
    "CCC[NH+]1CC": 1920,
    "COC(=O)C": 1921,
    "2CC1": 1922,
    ")cc1CC(C)": 1923,
    "c2cccc(OC)": 1924,
    "c2cc(F)ccc2": 1925,
    "c2ccc(F)c(F)": 1926,
    "C(C)C)c1": 1927,
    "S(=O)(=O)[O-])": 1928,
    "3CCCCC": 1929,
    "c3ncn": 1930,
    "N3CC": 1931,
    "O=C(CS": 1932,
    "NC(NCC": 1933,
    "c4)n": 1934,
    "[n+]1": 1935,
    "Cc1cs": 1936,
    "OCCC1": 1937,
    "#N)C": 1938,
    "C2=C(": 1939,
    "(c2ccc(": 1940,
    "c21C": 1941,
    "C(C)C2": 1942,
    "cccn2)": 1943,
    "3=O)": 1944,
    "c3ccc4c(c3)": 1945,
    "Br)ccc1": 1946,
    "CCCOCC": 1947,
    "C2)c1": 1948,
    "c1O=C(": 1949,
    "F)ccc3": 1950,
    "c1CC(=O)N": 1951,
    "c1ccc(C)cc1CC": 1952,
    "=OCCCC": 1953,
    "c(C)c2": 1954,
    "c1ccccc1N1CC": 1955,
    "CCNS(=O)(=O)": 1956,
    "c3ccccc3)c2": 1957,
    "c2)C1": 1958,
    "c2ccc(c3ccc(": 1959,
    "2CC(C)(C)": 1960,
    "c1cc(CC": 1961,
    "O=S(=O)(": 1962,
    "c3ccc(F)cc3": 1963,
    "[NH2+]CCCC": 1964,
    "3C2": 1965,
    "c2n1C": 1966,
    "CCC(N)=O)": 1967,
    "(CC)C": 1968,
    "c2c(F)cccc2": 1969,
    "Nc1nc(N": 1970,
    "ccc(N": 1971,
    "c1CC(C)(C)": 1972,
    "nc(C(=O)N": 1973,
    "=C2C(=O)": 1974,
    "c1ccc(Cl)c(Cl)c1": 1975,
    "NC(=O)CCC": 1976,
    "1F": 1977,
    "c2cccn": 1978,
    "C1=[NH+]": 1979,
    "C(F)F)cc": 1980,
    "c1C=CC": 1981,
    "c2cccc([N+](=O)[O-])": 1982,
    "NC(=O)CNC(=O)": 1983,
    "C(=O)CN(": 1984,
    ")C2=O)": 1985,
    ")CO": 1986,
    "N(C)C)": 1987,
    "O)cc2": 1988,
    "(C#": 1989,
    "c2ccc(F)c(": 1990,
    "5)C": 1991,
    "c1cc(C)cc": 1992,
    "C(=O)COC(=O)": 1993,
    "S(=O)(=O)N(C)": 1994,
    "Cl)c4": 1995,
    "cc5": 1996,
    "N(CCCC": 1997,
    "2CC(=O)N": 1998,
    "=O)c(": 1999,
    "N1CCC(": 2000,
    "[NH+]1C": 2001,
    "[NH+]2CCOCC": 2002,
    "C(c2ccc(": 2003,
    "Nc2ccc(": 2004,
    "c1cc(O)": 2005,
    "=S)n": 2006,
    "c3ccccc3)C2": 2007,
    "c2ccc3c(": 2008,
    "S(C)(=O)=O)cc": 2009,
    "1CCN(C(=O)": 2010,
    "CCCC)": 2011,
    "c1Cc1cc(": 2012,
    "1CCCN(": 2013,
    "sc(N": 2014,
    "(C)C(C)": 2015,
    "NC(=O)c1cc": 2016,
    "N=N": 2017,
    "N(C)S(=O)(=O)": 2018,
    "CCCCC3": 2019,
    "c1ccc(F)c(F)": 2020,
    "B(O)": 2021,
    "Sc1ccccc1": 2022,
    "c2cccc(F)c2": 2023,
    "CCCOC": 2024,
    "#N)CC": 2025,
    "NC(=S)": 2026,
    "c1cccc([N+](=O)[O-])c1": 2027,
    "CCOc1cc(C": 2028,
    "=C(O)C(=O)N(": 2029,
    "c1cc(C(F)(F)F)cc": 2030,
    "c3)cc": 2031,
    "c1nnn": 2032,
    "2)c1CCCC": 2033,
    "Cc1cc2": 2034,
    "c1C[NH2+]": 2035,
    "NC(=O)C([NH3+])C": 2036,
    "N1CCN(": 2037,
    "OC)cc1": 2038,
    "n2c(C": 2039,
    "c3)c2": 2040,
    "CC[NH+](CC(=O)N": 2041,
    "c1cccc(S(=O)(=O)N": 2042,
    "c1c(Cl)cc": 2043,
    "4C)": 2044,
    "c2)s": 2045,
    "c1cccc2ccccc1": 2046,
    "n2nn": 2047,
    "o2)cc": 2048,
    "CC2(": 2049,
    "C(C)(CC": 2050,
    "4c3": 2051,
    ")cc(N": 2052,
    "C1OCC": 2053,
    "c2ccc(C)cc": 2054,
    "F)c3": 2055,
    "N(CC)CC": 2056,
    "C(O)C(": 2057,
    "c1n[nH]": 2058,
    "c1ccccc1OCC": 2059,
    ")cc(C": 2060,
    "C(=O)[O-])c": 2061,
    "S(=O)(=O)C1CC": 2062,
    ")s": 2063,
    "n1ccc(": 2064,
    "3)cc(": 2065,
    "c3nc4ccccc4": 2066,
    "C(CCC(=O)[O-])": 2067,
    "1Cc1c(": 2068,
    "c3ccccc3)n": 2069,
    "c1CC(=O)": 2070,
    "c2ccnc(": 2071,
    "C(CNC(=O)": 2072,
    "1Cc1ccc(C": 2073,
    "c3ccccc23)": 2074,
    "C(O)=C(": 2075,
    "=CCCCCCCC": 2076,
    "O=c1": 2077,
    "CC(O)C": 2078,
    "c1Br": 2079,
    "c2no": 2080,
    "c(=O)c(": 2081,
    "n3cn": 2082,
    "NC(=O)C([NH3+])": 2083,
    "=OCC(C)": 2084,
    "c2ccccc12CC": 2085,
    "=Cc1ccccc1": 2086,
    "c3cccc(C(=O)N": 2087,
    ")C(=O)[O-]": 2088,
    "C)cc1CC": 2089,
    "3)cs": 2090,
    "c(C3CC": 2091,
    "C(=O)NC1": 2092,
    "ccccc8": 2093,
    "n1c1ccccc1": 2094,
    "c2sccc2": 2095,
    "NC(=O)c2ccccc2": 2096,
    "N#Cc1": 2097,
    "c2cccc3ccccc2": 2098,
    "c(OCC": 2099,
    "ccc(C)": 2100,
    "C(O)CC": 2101,
    "Cl)nc(": 2102,
    "c(C#N": 2103,
    "F)cc(F)": 2104,
    "2CCC(C)": 2105,
    "(C3CC": 2106,
    "Br)CC": 2107,
    "Cc1nc(": 2108,
    "CCCN(C(=O)": 2109,
    "OC(=O)C(C)": 2110,
    "C)C(=O)": 2111,
    ")NC1CC": 2112,
    "C(=O)NC(C(=O)N": 2113,
    "n(C)c1": 2114,
    "[nH]c2c1": 2115,
    "c2cc(C)ccc2": 2116,
    "c5cc(": 2117,
    "cccnc1": 2118,
    "n1ccnc1": 2119,
    "C(C)=O)cc": 2120,
    ")nc1": 2121,
    "2C[NH2+]": 2122,
    "CNC(=O)N": 2123,
    "c2)ccc1": 2124,
    "2)cc1O=C(": 2125,
    "CC(C(=O)[O-])": 2126,
    "=CC=": 2127,
    ")N(C)": 2128,
    "(C)C)cc1": 2129,
    "c1cc(S(=O)(=O)N": 2130,
    "c2ccc(Br)": 2131,
    "(F)c2": 2132,
    "[NH2+]CC(=O)N": 2133,
    "2)ccc1Cl": 2134,
    "c2ccc(F)": 2135,
    "CC[NH+](C(C)C(=O)N": 2136,
    "2COc1ccc(": 2137,
    "C2CCC(": 2138,
    "Sc1ccc(": 2139,
    "O)ccc1": 2140,
    "1(=O)": 2141,
    "CC([NH2+]": 2142,
    "c1cc2cc(": 2143,
    "c5cccc": 2144,
    "C=C(C)": 2145,
    "2)cc1COc1ccc(": 2146,
    "n1C)": 2147,
    "c3=O)": 2148,
    "(C)(": 2149,
    ")c4ccccc4": 2150,
    "c3cccc(C)": 2151,
    "C1(C)CC": 2152,
    "c2n[nH]": 2153,
    "C([NH3+])CC": 2154,
    "C1(O)": 2155,
    "c1ccc2cc(": 2156,
    "CC)c1": 2157,
    "N(CC(=O)": 2158,
    "[nH+]cc": 2159,
    "1O=C([O-])": 2160,
    "C(Cc2ccccc2)": 2161,
    "OCC3": 2162,
    "nc(N)n": 2163,
    "ccn1": 2164,
    "1CC(O)": 2165,
    "NCCC": 2166,
    "(O)CC": 2167,
    "C(F)(F)F)c(": 2168,
    "cc1F": 2169,
    "F)c(Cl)c1": 2170,
    "2)O": 2171,
    "F)cn": 2172,
    "c12C": 2173,
    "C(F)(F)C(F)(F)C(F)(F)C(F)(F)": 2174,
    "(C[NH3+]": 2175,
    "c(=O)o": 2176,
    "n1ncc(": 2177,
    "c1ccc(NC(=O)N": 2178,
    "CC2CCCC": 2179,
    "(C)CO": 2180,
    "S(N)(=O)=O)": 2181,
    "NC(C)=O)": 2182,
    ")C1(": 2183,
    "C(O)C(C)": 2184,
    "c2cccc(N": 2185,
    "#N)n": 2186,
    "2)cc1Cl": 2187,
    "F)c(C": 2188,
    "c1ccc(O)cc1)": 2189,
    "c1ccc2c(c1)CC": 2190,
    "CC[NH+]1CC": 2191,
    "C6": 2192,
    "c1CS": 2193,
    "C(N)=[NH2+]": 2194,
    "3C(=O)": 2195,
    "SS": 2196,
    "C(=O)Nc3ccc(": 2197,
    "1OC(": 2198,
    "c2cnn(C)": 2199,
    "S(=O)(=O)N2CCCC": 2200,
    "c1ccc2c(c1)OCCO": 2201,
    "c1c(F)cccc1": 2202,
    "c1ccncc1": 2203,
    "=C(S": 2204,
    "OC(CO)C(O)C(O)": 2205,
    "F)cc1F": 2206,
    "3)CC2)n": 2207,
    "3)c2)": 2208,
    "[NH3+]C(C": 2209,
    "(C)(C)OC(=O)N": 2210,
    "[NH2+]C(C)C)": 2211,
    "C(=O)N1CCN(": 2212,
    "C(C)[NH2+]": 2213,
    "c1ccccc1)c1": 2214,
    "C(F)(F)F)cc2": 2215,
    "C(NC(=O)N": 2216,
    "CCOC(=O)C": 2217,
    "c1c(Cl)cccc1": 2218,
    "2)cc1OCC": 2219,
    "nn1C": 2220,
    "2)cc1Cc1ccc(": 2221,
    "c1cc(O": 2222,
    "c1ccc(CN": 2223,
    "oc(=O)": 2224,
    "c1noc(": 2225,
    "C1(CC": 2226,
    "OC(=O)CC": 2227,
    "[NH+]2CCN(": 2228,
    "s2)c1": 2229,
    "OCCCCCCCC": 2230,
    "C(=[NH+]": 2231,
    "#[N+]": 2232,
    "c3ccc([N+](=O)[O-]": 2233,
    "c2cc(Cl)c(": 2234,
    "2CC[NH2+]CC": 2235,
    "F)c(N": 2236,
    "=OCOc1ccc(": 2237,
    "CC(C)(": 2238,
    "FCC(C)": 2239,
    "CC(OC(=O)": 2240,
    ")CC(=O)N": 2241,
    "1C2CC": 2242,
    "4)CC3)": 2243,
    "c1cccc2cccc": 2244,
    ")c1C": 2245,
    "c1cc(N2CC": 2246,
    "C(=CC": 2247,
    "c7ccccc7": 2248,
    "[NH+]3CCCC": 2249,
    "N(C(C)=O)": 2250,
    "cc1Br": 2251,
    "C(Br)": 2252,
    "CC1CCCCC1": 2253,
    "NC(=O)N1CC": 2254,
    "C(N)=O": 2255,
    "3)cc1CC": 2256,
    "cc1OCC": 2257,
    "c(F)c1C": 2258,
    "c(=O)n(": 2259,
    "Nc1ncc(": 2260,
    "c1cn(": 2261,
    "3)[nH]": 2262,
    "c2noc(": 2263,
    "2)CC1CO": 2264,
    "C(=O)N2CCN(": 2265,
    "I)c(": 2266,
    "C(c1ccccc1)": 2267,
    "C1CC(=O)": 2268,
    "CCNC(=O)N": 2269,
    "Br)ccc2": 2270,
    "2)cc1F": 2271,
    "c9": 2272,
    "c1cc(Cl)cc(": 2273,
    "c(=O)n(C)": 2274,
    "C)CC2)": 2275,
    "3CC(": 2276,
    ")[nH]": 2277,
    "[NH+](C(C)C(=O)N": 2278,
    "S1(=O)": 2279,
    "c1ccc(C(C)": 2280,
    "=C(N)": 2281,
    "C2CCCCC": 2282,
    "C(=O)C1C": 2283,
    "CN(CC": 2284,
    "c3ccccc3Cl)": 2285,
    "c2ccn": 2286,
    "Cc1cc(C)": 2287,
    "C(=O)Nc1ccccc1": 2288,
    ")c1CC": 2289,
    "=C(CC": 2290,
    "(C=O)": 2291,
    "c1C#": 2292,
    "c2nccc(": 2293,
    "cccc1C": 2294,
    "c1ccc(Cl)cc1)": 2295,
    "1Cc2ccccc2": 2296,
    "cn3": 2297,
    "c1ccc(Cl)cc1Cl": 2298,
    "CC(C)(C)C": 2299,
    "OCc2ccccc2)": 2300,
    "c1cnn": 2301,
    "C2)cc1CC": 2302,
    "c1ccc(NS(=O)(=O)": 2303,
    "(CC(C)": 2304,
    "OC)c2": 2305,
    "c1ccc(F)cc1)": 2306,
    "C(C)C1CC": 2307,
    "OCc3ccccc3)": 2308,
    "[NH3+]C(": 2309,
    "C(=O)N2CCC(": 2310,
    "3CCOCC3)": 2311,
    "OCc1cc(": 2312,
    "(CC(=O)[O-]": 2313,
    "Oc3ccc(": 2314,
    "CCCCC1C": 2315,
    "3)no2)": 2316,
    "c1cccc(OCC": 2317,
    "2)c1CCO": 2318,
    "c1)C": 2319,
    "C#N)": 2320,
    "C(C)C)n": 2321,
    "O=[N+]([O-])": 2322,
    "C(CC(=O)": 2323,
    "c1cco": 2324,
    "c(c5": 2325,
    "=O)cc(": 2326,
    "C1CCCN(": 2327,
    "C(C(=O)[O-]": 2328,
    "CC1CC(": 2329,
    "c2ccccc2)cc": 2330,
    "3CO": 2331,
    "[N+](=O)[O-])ccc1": 2332,
    "c3ccccc3)cc2": 2333,
    "2CCC(C": 2334,
    "c(=O)n1": 2335,
    "C[NH2+]CC": 2336,
    "C(C)(C)CO": 2337,
    "C(F)(F)F)n": 2338,
    "C(N)=O)cc": 2339,
    "CCCC3)": 2340,
    "OC1CC(": 2341,
    "c2ccc(Br)cc": 2342,
    "C(CS": 2343,
    "c4ccc(c5": 2344,
    "c1cc(C2": 2345,
    "2C3": 2346,
    "c1c2c(": 2347,
    "=CC=C": 2348,
    "3CC(C": 2349,
    "1CCC1": 2350,
    "c2ccccc12C": 2351,
    "NC(=O)CN(": 2352,
    "C(C)CCO": 2353,
    "1CCCCC1)": 2354,
    "C(C)CC)": 2355,
    "c1ccc(CO": 2356,
    "Cc1ccc2c(c1)": 2357,
    "C(=O)[O-]CC": 2358,
    "CC(=O)N1CC": 2359,
    "c3ccc(C)cc": 2360,
    "3)c2)c1": 2361,
    "1CCCN(C(=O)": 2362,
    "CN(C)C(=O)": 2363,
    "c2cc(C(F)(F)F)cc": 2364,
    "c2ccccc21": 2365,
    "OCC1O": 2366,
    "O)C1CC": 2367,
    "c2nc(C)": 2368,
    "OCO=C(": 2369,
    "N(Cc1ccccc1)": 2370,
    "c3)cc2": 2371,
    "1COC": 2372,
    "c1cc(F)cc(F)": 2373,
    "c1nc(=O)": 2374,
    "c3ncc(": 2375,
    "(=O)OCC": 2376,
    "(Cc2ccccc2": 2377,
    "Oc2cc(": 2378,
    "F)cc2)": 2379,
    "1COc1cc": 2380,
    "c4ccccc3": 2381,
    "[NH2+]C(C)(C)": 2382,
    "Fc1ccc(": 2383,
    "NC(=O)C2CCC": 2384,
    "2)cc1CCO": 2385,
    "c(Br)": 2386,
    "F)ccc2": 2387,
    "c1ccc(c2ccccc2": 2388,
    "S2": 2389,
    "Br)cc1C": 2390,
    "C1=C": 2391,
    "C1CC1CC": 2392,
    "CCC3)": 2393,
    "c1c[nH+]": 2394,
    "[Si](=O)": 2395,
    "Oc1cccc(": 2396,
    "c2ccc(n3": 2397,
    "c(N)c(": 2398,
    "3)C1)C": 2399,
    "[NH2+]CCO": 2400,
    "c2cccc(O)": 2401,
    "=C4": 2402,
    "CC(CC)": 2403,
    "c(C)cc1": 2404,
    "2CCOCC2)": 2405,
    "CCCO2)": 2406,
    "=NC(": 2407,
    "c(C)cc(": 2408,
    "c2ccc(C3": 2409,
    "OC2)": 2410,
    "=C(O)C(=O)N2": 2411,
    "n2ccc": 2412,
    "CCCCCO": 2413,
    "c(NCC": 2414,
    "[nH]c4": 2415,
    "C1CCCCCC": 2416,
    "COC1CC": 2417,
    "CCOc1cc(": 2418,
    "CS(=O)(=O)": 2419,
    "c2ccc(C(=O)[O-]": 2420,
    "ncc3": 2421,
    "C)C1CC": 2422,
    "CC1CC1": 2423,
    "3CC[NH2+]CC": 2424,
    "c1cnn(": 2425,
    "Br)s": 2426,
    "c(C(C)(C)C)": 2427,
    "NC(=O)C2CC": 2428,
    "C1OC(": 2429,
    "c3c(F)": 2430,
    "CC(=O)N(": 2431,
    "N(C)CC": 2432,
    "C(F)(F)F)cn": 2433,
    "c2cnc(N": 2434,
    "c2ccccc2OC)": 2435,
    "SCC(=O)": 2436,
    "n2CC": 2437,
    "COC1": 2438,
    "C(=O)N1C": 2439,
    "=S)[nH]": 2440,
    "c(C[NH+]": 2441,
    "3)nc1": 2442,
    "n2ccnc2": 2443,
    "CCC([NH3+])": 2444,
    "O=S(=O)(N": 2445,
    "Cc1csc(": 2446,
    "6)": 2447,
    "=CC(=O)[O-]": 2448,
    "SC1CC": 2449,
    "1COc1ccc(N": 2450,
    "C)c(": 2451,
    "c1[nH]c(": 2452,
    "n2)n": 2453,
    "ccc3C)": 2454,
    "[NH+]1CCCC": 2455,
    "Cc1cccc(C": 2456,
    "c1c[nH]c2ccccc12)": 2457,
    "c2)o": 2458,
    "4C": 2459,
    "3)cc2)cc": 2460,
    "c2cc(=O)": 2461,
    "C(=O)OCCCC": 2462,
    "c1nc(Cl)": 2463,
    "S(=O)(=O)NCC": 2464,
    "sc4": 2465,
    "c(C)n1": 2466,
    "N#CC(": 2467,
    "c3cc(C(=O)N": 2468,
    "c2cc(S(=O)(=O)N": 2469,
    "c3ccc(C(F)(F)F)cc": 2470,
    ")N1CCN(": 2471,
    "C(=O)NCC2": 2472,
    "c3ccccc3C)": 2473,
    "OCC)c1": 2474,
    ")cc2c1": 2475,
    "c1c(F)cc": 2476,
    "c3ccc(OCC": 2477,
    "[NH3+])C1CC": 2478,
    "2)c1F": 2479,
    "(COC(=O)": 2480,
    "CC1CCC(": 2481,
    "c2ccc(c3": 2482,
    "N(CC(C)C)": 2483,
    "N1C(=O)C(": 2484,
    "=OCCC": 2485,
    "c3cccc(C(F)(F)F)": 2486,
    "cc(Br)": 2487,
    "OC(=O)C": 2488,
    "c(N3CC": 2489,
    "c2sc3c(": 2490,
    "Cl)c1)": 2491,
    "2(C)": 2492,
