{
    "<s>": 0,
    "<pad>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<mask>": 4,
    "O": 5,
    "=": 6,
    "C": 7,
    "(": 8,
    "c": 9,
    "1": 10,
    "-": 11,
    "2": 12,
    "3": 13,
    ")": 14,
    "N": 15,
    "4": 16,
    "[C@H]": 17,
    "n": 18,
    "Cl": 19,
    "[C@]": 20,
    "#": 21,
    "F": 22,
    "S": 23,
    "[C@@H]": 24,
    "o": 25,
    "[nH]": 26,
    "s": 27,
    "Br": 28,
    "5": 29,
    "/": 30,
    "[C@@]": 31,
    "[n+]": 32,
    "6": 33,
    "7": 34,
    "8": 35,
    "9": 36,
    "%10": 37,
    "P": 38,
    "[O-]": 39,
    ".": 40,
    "[Na+]": 41,
    "[N+]": 42,
    "[o+]": 43,
    "%11": 44,
    "%12": 45,
    "%13": 46,
    "%14": 47,
    "%15": 48,
    "%16": 49,
    "%17": 50,
    "%18": 51,
    "[18F]": 52,
    "[O]": 53,
    "[N-]": 54,
    "B": 55,
    "[2H]": 56,
    "[Si]": 57,
    "I": 58,
    "[K+]": 59,
    "[K]": 60,
    "%19": 61,
    "%20": 62,
    "%21": 63,
    "%22": 64,
    "[14C]": 65,
    "[14CH]": 66,
    "[11CH3]": 67,
    "[NH-]": 68,
    "[S+]": 69,
    "[Ca+2]": 70,
    "[PH]": 71,
    "[Br-]": 72,
    "[Li+]": 73,
    "[Cl-]": 74,
    "[Cl+3]": 75,
    "[11C]": 76,
    "[S@@]": 77,
    "[Se]": 78,
    "[O+]": 79,
    "[N@+]": 80,
    "[Al]": 81,
    "[125I]": 82,
    "[14CH2]": 83,
    "[3H]": 84,
    "[I-]": 85,
    "[S-]": 86,
    "[B-]": 87,
    "[NH+]": 88,
    "[N@]": 89,
    "[n-]": 90,
    "p": 91,
    "[14c]": 92,
    "[N@@]": 93,
    "[C-]": 94,
    "[P+]": 95,
    "%23": 96,
    "%24": 97,
    "%25": 98,
    "[P@]": 99,
    "[76Br]": 100,
    "[P@@]": 101,
    "[N@@+]": 102,
    "[Te]": 103,
    "[S@]": 104,
    "cc": 105,
    "CC": 106,
    "O)": 107,
    "C(": 108,
    "(C": 109,
    "c1": 110,
    "c(": 111,
    "c2": 112,
    "=O)": 113,
    "ccc": 114,
    "c3": 115,
    "cccc": 116,
    ")cc": 117,
    "F)": 118,
    "C(=O)": 119,
    "C)": 120,
    "2)": 121,
    ")C": 122,
    "c1cc": 123,
    "(C)": 124,
    "1C": 125,
    "cc(": 126,
    "ccc(": 127,
    "N)": 128,
    "1CC": 129,
    "3)": 130,
    "CN": 131,
    "cn": 132,
    "(CC": 133,
    ")n": 134,
    "C(=O)N": 135,
    "[C@H](": 136,
    "CCN": 137,
    "[C@@H](": 138,
    "NC(=O)": 139,
    "c4": 140,
    "2CC": 141,
    ")N": 142,
    "CCC": 143,
    "c(-": 144,
    "(=O)": 145,
    "OC": 146,
    "n1": 147,
    "nc": 148,
    "c1cccc": 149,
    "c2cccc": 150,
    "nc(": 151,
    "c(N": 152,
    "CO": 153,
    "-c2": 154,
    "O=": 155,
    "c1ccc(": 156,
    "c1n": 157,
    "ccccc": 158,
    "c2n": 159,
    "OCC": 160,
    "n2": 161,
    "(F)": 162,
    ")CC": 163,
    "(N": 164,
    "CCCC": 165,
    "Cl)": 166,
    "NC": 167,
    "1)": 168,
    "=C(": 169,
    "2C": 170,
    "c2cc": 171,
    "C(F)": 172,
    "c2)": 173,
    ")cc1": 174,
    "C(=O)N[C@@H]": 175,
    "C(C)": 176,
    "c2ccc(": 177,
    "C1": 178,
    "4)": 179,
    "F)cc": 180,
    "ccc3": 181,
    "[C@H](C": 182,
    "N(": 183,
    "3CC": 184,
    "NC(=O)[C@H]": 185,
    "nn": 186,
    "c3cc": 187,
    "-c3": 188,
    "c(=O)": 189,
    "2)cc": 190,
    "[C@@H](C": 191,
    "ncc": 192,
    "c1)": 193,
    "c3ccc(": 194,
    "c1cc(": 195,
    "nc2": 196,
    "Cl)cc": 197,
    "C(=": 198,
    "c1ccccc1": 199,
    "c2c(": 200,
    "3)cc": 201,
    "(O)": 202,
    "C(=O)O)": 203,
    "O=C(": 204,
    "c2ccccc2": 205,
    "1O": 206,
    "Oc1cc": 207,
    "ccc(C": 208,
    "1CO": 209,
    "(C)C)": 210,
    "O)cc": 211,
    "(-": 212,
    "c1C": 213,
    "N)=O)": 214,
    "C(N)": 215,
    "C(F)(F)": 216,
    "c2cc(": 217,
    "c(C": 218,
    "CC1": 219,
    "c3ccccc": 220,
    "(=O)N": 221,
    "C(N": 222,
    "C(=O)N[C@@H](CC": 223,
    "OC)": 224,
    "C2": 225,
    "N[C@@H]": 226,
    "n3": 227,
    "[C@@H](CC": 228,
    "3)n": 229,
    "c5": 230,
    "(C)C": 231,
    "c[nH]": 232,
    "N(C": 233,
    "Cc1": 234,
    "[C@@H](C)": 235,
    "N1CC": 236,
    "c1cn": 237,
    "2)n": 238,
    "(CN": 239,
    "c2c1": 240,
    "N)N)": 241,
    "c3n": 242,
    "nc3": 243,
    "CC(": 244,
    "NC(=O)[C@H](CC": 245,
    "2)CC": 246,
    "1CN": 247,
    "c1ccc(-": 248,
    "C[C@H]": 249,
    "CC2)": 250,
    "=O": 251,
    "c3cccc": 252,
    "[C@H](CC": 253,
    "[C@H]1": 254,
    "4CC": 255,
    "c1ccc": 256,
    "2)c1": 257,
    "(C(=O)": 258,
    ")cc2": 259,
    "NCC": 260,
    "1CCN": 261,
    "2CCN": 262,
    "[C@H]2": 263,
    "3C": 264,
    "cc1": 265,
    "(C)CC": 266,
    "[C@H](O)": 267,
    "n2)": 268,
    "c1CC": 269,
    "CCN)": 270,
    "[C@@H]2": 271,
    "S(=O)": 272,
    "C(O)": 273,
    "nc1": 274,
    "nc(N": 275,
    "O[C@@H]": 276,
    "cccn": 277,
    "c(C)": 278,
    "ccn": 279,
    "3)CC": 280,
    "c1cccc(": 281,
    "c4ccccc": 282,
    "NC(=O)[C@H](C": 283,
    "[C@@H]1": 284,
    "=N": 285,
    "[C@@H](O)": 286,
    "[C@H](C)": 287,
    "C(=O)N[C@@H](C": 288,
    "ccc4": 289,
    "c2ccc": 290,
    "3)C": 291,
    "C(C)C)": 292,
    "c3)": 293,
    "c(-c3": 294,
    "C(F)(F)F)": 295,
    "C1CC": 296,
    "CNC(=O)": 297,
    "ccccc3": 298,
    "C(N)=O)": 299,
    "4)n": 300,
    "c2ccccc2)": 301,
    "c2cn": 302,
    "cc2": 303,
    "(=O)O)": 304,
    "ncn": 305,
    "c3cc(": 306,
    "4)cc": 307,
    "cccc(": 308,
    "[C@H]3": 309,
    "c3c(": 310,
    "cs": 311,
    "O=C(O)": 312,
    "c4ccc(": 313,
    "c1ccccc1)": 314,
    "[C@@H]3": 315,
    "nc(-": 316,
    "c1-": 317,
    "c(-c2": 318,
    "(O": 319,
    "CNC(=": 320,
    "1N": 321,
    "=C": 322,
    "c1ccc(C": 323,
    "CCN(": 324,
    "c(Cl)": 325,
    "c3ccc": 326,
    "1Cc1cc": 327,
    "C(C": 328,
    "NC(=O)[C@@H](": 329,
    "C(=O)N1CC": 330,
    "1C(=O)": 331,
    "C(=O)NCC": 332,
    "c(N)": 333,
    "CCO": 334,
    "C(=O)NC": 335,
    "c1c(": 336,
    "c(F)": 337,
    "c1cc2": 338,
    "c2cccc(": 339,
    "C3": 340,
    "1CC(C)": 341,
    "O[C@H]": 342,
    "2)C": 343,
    "c3ccccc3": 344,
    "n4": 345,
    "c1ccc2": 346,
    "1CCCN": 347,
    ")cc1C": 348,
    "c(O)": 349,
    "c12": 350,
    "1Cc1": 351,
    "CC2": 352,
    "2)cc1": 353,
    "O=C(N": 354,
    "C(=O)N[C@H](": 355,
    "#N)": 356,
    "CN1CC": 357,
    "C(=O)C": 358,
    "3CCN": 359,
    "n1C": 360,
    "C(F)(F)F)cc": 361,
    "NC(=O)[C@@H]": 362,
    ")cc2)": 363,
    "-c4": 364,
    "c2ccc3": 365,
    "[C@H]1CC": 366,
    "ccccc2": 367,
    "3)c2": 368,
    "c1ccc(N": 369,
    "OCO": 370,
    "C(F)(F)F": 371,
    "cc(-": 372,
    "1CCN(": 373,
    "N2CC": 374,
    "nc(C": 375,
    "ccccc4": 376,
    "cc3": 377,
    "cnc3": 378,
    "5)": 379,
    ")N1CC": 380,
    "Nc1n": 381,
    "S(=O)(=O)": 382,
    "1CCC": 383,
    "c1nc(": 384,
    "c(=O)[nH]": 385,
    "=OC": 386,
    "c3ccccc3)": 387,
    "N#": 388,
    "NC(=O)N": 389,
    "[C@H](CO)": 390,
    "(CO)": 391,
    "4)CC": 392,
    "n(": 393,
    "SC": 394,
    "1COc1cc": 395,
    "n(C": 396,
    ")cc(": 397,
    "(-c2": 398,
    "=O)cc": 399,
    "#N": 400,
    "n(C)": 401,
    "CC(=O)N": 402,
    "2CN": 403,
    "c2[nH]": 404,
    ".Cl": 405,
    "(C)(C)": 406,
    "1=": 407,
    "c23)": 408,
    "-c2ccc(": 409,
    "Br)": 410,
    "2CCCN": 411,
    "c12)": 412,
    "(CCCN": 413,
    "CNC(=N)N)": 414,
    "c1CO": 415,
    "c3c2": 416,
    "c2)n": 417,
    "2CO": 418,
    "/C": 419,
    "[C@@H]1CC": 420,
    "c1N": 421,
    "C[C@@H]": 422,
    "C(=O)N2CC": 423,
    ")cc3": 424,
    "cccc2": 425,
    "CN(": 426,
    "CC(C)": 427,
    "cnc2": 428,
    "1)C": 429,
    "c2ccccc1": 430,
    "[C@H](NC(=O)": 431,
    "(N)=O)": 432,
    "[C@H]1C": 433,
    "cnn": 434,
    "c(-c4": 435,
    "N2": 436,
    "C(=O)N[C@@H](CC(C)C)": 437,
    "c1ccc(O)cc": 438,
    "1CCCC": 439,
    "c2ccc(Cl)cc": 440,
    "C1C": 441,
    "c(O": 442,
    "NC(=O)C": 443,
    "c1cc(-c2": 444,
    "c1c[nH]": 445,
    "P(=O)": 446,
    "c3cn": 447,
    "N)C": 448,
    "c1O": 449,
    "O)C": 450,
    "C(=O)O": 451,
    "C(=O)N[C@@H](CCCCN)": 452,
    "c2ccc(-c3": 453,
    "nc(N)": 454,
    "c(-c2ccc(": 455,
    "c1cccc2": 456,
    "N3": 457,
    "N(C(=O)": 458,
    "c3)n": 459,
    "CC(=O)": 460,
    "nc(C)": 461,
    "c1ccc2c(": 462,
    "c4ccccc4": 463,
    "c2ccc(F)cc": 464,
    "OCCN": 465,
    "2)cc1C": 466,
    "(Cl)": 467,
    "O[C@@H](": 468,
    "N(C)": 469,
    "cc(C": 470,
    "NC1": 471,
    "C(C)(C)": 472,
    "4)C": 473,
    "2C(=O)": 474,
    "[C@@H](C)O)": 475,
    "c(-c3ccc(": 476,
    "C(=O)N[C@@H](C)": 477,
    "N1": 478,
    "CCN(CC": 479,
    "c4)": 480,
    "c(OC)": 481,
    "n1cc(": 482,
    "1O=C(": 483,
    "c1c": 484,
    "C(C)=O)": 485,
    "[C@@H]1C": 486,
    "OC(": 487,
    "3)cc2": 488,
    "c1CN": 489,
    "NC(=O)CN": 490,
    "(F)F)": 491,
    "1)N": 492,
    "n[nH]": 493,
    "N(CC": 494,
    "CC1C": 495,
    "c1cc(N": 496,
    "1Cn1": 497,
    "CC)": 498,
    ".O=C(O)": 499,
    "CN(C": 500,
    "1CCC(": 501,
    "S)": 502,
    "Cc1cc": 503,
    "Br)cc": 504,
    "(C)c1": 505,
    "c3ccc(F)cc": 506,
    "Cl)cc1": 507,
    "CN=C(": 508,
    "c2cc3": 509,
    "c2cc(-c3": 510,
    "F)cc1": 511,
    "NC(=O)[C@H](CC(C)C)": 512,
    "2c(": 513,
    "CCN(C": 514,
    "-c3ccc(": 515,
    "c2nc(": 516,
    "cccc3": 517,
    "c(C(=O)N": 518,
    "n2)cc": 519,
    "cccc1": 520,
    "4C": 521,
    "3CCOCC": 522,
    "nc4": 523,
    "5CC": 524,
    "n3)": 525,
    "C2)": 526,
    "c1nn": 527,
    "1(": 528,
    "NC(=O)[C@H](": 529,
    "CC3)": 530,
    "c2ccc(C": 531,
    "3)CC2)": 532,
    "cnc(N": 533,
    "1Cc1n": 534,
    "NC(=O)[C@H](C)": 535,
    "c2)cc": 536,
    "2CCC": 537,
    "n1CC": 538,
    "C(C)(C)C)": 539,
    "OP": 540,
    "3)cc2)": 541,
    "(N)": 542,
    "c2)CC": 543,
    "2CCCCC": 544,
    "c2ccccc2)n": 545,
    "2CCN(": 546,
    ")cc3)": 547,
    "C[C@H]1": 548,
    "O)O": 549,
    "(C(=O)N": 550,
    "no": 551,
    "3)cc1": 552,
    "2)cn": 553,
    "n(CC": 554,
    "c1ccc(C(=O)N": 555,
    "1CC1": 556,
    "c1ccc(O": 557,
    "[C@H](O": 558,
    ")C2": 559,
    "ccccc5": 560,
    "Cl)c(": 561,
    "NC(=O)CNC(=O)": 562,
    "2CCOCC": 563,
    "=OCC": 564,
    "cn1": 565,
    "NC(=O)[C@H](CCCCN)": 566,
    "1CC(=O)N": 567,
    "[nH]c(=O)": 568,
    "c2ncn": 569,
    "Cl)n": 570,
    "3CCCC": 571,
    "c4cccc": 572,
    "[nH]c2": 573,
    "cc(N": 574,
    "c1ccccc1-": 575,
    "OC)cc": 576,
    "2)CC1": 577,
    "c2nc(-": 578,
    "4)c3": 579,
    "(C)C(=O)": 580,
    "c1nc(-": 581,
    "cc(-c2": 582,
    "[C@]1": 583,
    "c3ccc(Cl)cc": 584,
    "SCC": 585,
    "c4cc(": 586,
    "n1)": 587,
    "CCN1CC": 588,
    "CC1CC": 589,
    "[C@@H](O": 590,
    "F)c(": 591,
    "O=C(NC": 592,
    "c4cc": 593,
    "c1ncn": 594,
    "NC(=O)[C@H](CO)": 595,
    "c1cccc(-c2": 596,
    "C(=O)N[C@@H](CCCNC(=N)N)": 597,
    "2c1": 598,
    "(C)O": 599,
    "(=O)=O)": 600,
    "c1cc(C": 601,
    "3CCC": 602,
    "3CCCCC": 603,
    "2CCCC": 604,
    "c6": 605,
    "2)cc1CC": 606,
    "C(=O)NCC(=O)N": 607,
    "O=C1": 608,
    "ccc5": 609,
    "c2ccc(N": 610,
    "(C(F)(F)F)": 611,
    "C(=O)O)cc": 612,
    "c1[nH]": 613,
    "c2c[nH]": 614,
    "[C@H]2C": 615,
    "N)CC": 616,
    "Nc1": 617,
    "cc(Cl)": 618,
    "cc(-c3": 619,
    "C(=O)N[C@@H](Cc1ccccc1)": 620,
    "cn2)": 621,
    "[C@@H]4": 622,
    "[C@H](N": 623,
    "ccc2": 624,
    "[C@]2": 625,
    "O=c1": 626,
    "c(-c2n": 627,
    "Cn1": 628,
    "3)nc2": 629,
    "-c3ccccc": 630,
    "C(=O)N[C@@H](CCC(=O)O)": 631,
    "2CCC(": 632,
    "N3CC": 633,
    "n1-": 634,
    "c2)C": 635,
    "S(C)": 636,
    "c3ccc4": 637,
    "OCCO": 638,
    "C(CC": 639,
    "OCCOCC": 640,
    "CCCN": 641,
    "C(=O)N[C@@H](CO)": 642,
    "[C@@H](N": 643,
    "c2ccc(O)cc": 644,
    "C(=O)OC": 645,
    "ncc(": 646,
    "[C@H]2CC": 647,
    "Cl)c(Cl)": 648,
    "CN(CC": 649,
    "c1cccc(N": 650,
    "[C@@]2": 651,
    "2)n1": 652,
    "c2s": 653,
    "cnc4": 654,
    "cc(C)": 655,
    "CCC1": 656,
    "c4ccccc4)": 657,
    "c1cccc(C": 658,
    "CCCCCCCC": 659,
    "CCNC(=O)": 660,
    "1CCCN1C(=O)": 661,
    "2CC2)": 662,
    "n1c(=O)": 663,
    "ncc2": 664,
    "c12C": 665,
    "[C@H]4": 666,
    "CN1": 667,
    "5)n": 668,
    "C(=O)N[C@@H](CCC(N)=O)": 669,
    "c2ccccc2)CC": 670,
    "c1ccc(O)cc1)": 671,
    "1CCN(CC": 672,
    "1O=": 673,
    "c1ccc(Cl)cc": 674,
    "cc(F)": 675,
    "NC(=O)[C@@H](C": 676,
    "[C@H]1O": 677,
    "s2)": 678,
    "c12CC": 679,
    "c(NC": 680,
    "1COc1ccc(": 681,
    ")ccc1": 682,
    "c1Cl": 683,
    "c1ccc(-c2n": 684,
    "(=": 685,
    "c2ccccc12)": 686,
    ")C1": 687,
    "c1no": 688,
    "OC)c(": 689,
    "NC(=O)[C@H](CCCNC(=N)N)": 690,
    "1CN1CC": 691,
    "Cl)c1": 692,
    "c1ccc(NC(=O)": 693,
    ".O=C(O)C(F)(F)F": 694,
    "4CCOCC": 695,
    "cncn": 696,
    "n2)cc1": 697,
    "c2n1C": 698,
    "[C@@]1": 699,
    "[C@@H]2C": 700,
    "3)ccc2": 701,
    "#C": 702,
    "nc5": 703,
    "2)CC1C": 704,
    "NC(=O)[C@H](CCC(=O)O)": 705,
    "c2=O)": 706,
    "c1nc(N": 707,
    ")cc1CC": 708,
    "=C/": 709,
    "Cl)cc2": 710,
    "Cl.": 711,
    "C(C)(C)C": 712,
    "O)CC": 713,
    "c2ccncc": 714,
    "C2CC": 715,
    "c2c(c1)": 716,
    "s1": 717,
    "OC(=O)": 718,
    "[C@@H](O)[C@H](O)": 719,
    "c1nc2c(": 720,
    ")ccc2": 721,
    "C(C)C": 722,
    "c2)c1": 723,
    "1COc1cc(": 724,
    "[C@@H]1O": 725,
    "Oc1ccc(-": 726,
    "N=C(": 727,
    "c(=O)n": 728,
    "5)cc": 729,
    "cn2": 730,
    "n1cn": 731,
    "n2cn": 732,
    "2N": 733,
    "c3cccc(": 734,
    "3)cn": 735,
    "c2)cc1": 736,
    "2CCN(C": 737,
    "c1)C": 738,
    "(-c3": 739,
    "c2cc1": 740,
    "3)c1": 741,
    "c(C(=O)O)": 742,
    "2)C1": 743,
    "NC(=O)[C@H](CCC(N)=O)": 744,
    "c2cccc3": 745,
    "[C@H](N)": 746,
    "1CCCCC": 747,
    "c4)n": 748,
    "C(=O)N1C": 749,
    "ncc1": 750,
    "CS": 751,
    "[nH]n": 752,
    "(C)n": 753,
    "1CCO": 754,
    "c1OCC": 755,
    "c(CC": 756,
    "4CCCC": 757,
    "c1ncc": 758,
    "c1ccc(OC": 759,
    "C3)": 760,
    "3)n2": 761,
    "C[C@H](": 762,
    "c(cc": 763,
    "c1ccc(-n2": 764,
    "P(=O)(O)": 765,
    "(CC(=O)N": 766,
    "CN(C(=O)": 767,
    "c4cn": 768,
    "4CCN": 769,
    "4)cc3)": 770,
    "c(c2)": 771,
    "F)cc2": 772,
    "c1ncc(": 773,
    "[nH]c3": 774,
    "F)cc2)": 775,
    "Oc1ccc(": 776,
    "O[C@H](CO)": 777,
    "3CC3)": 778,
    "N4": 779,
    "c3cc4": 780,
    "[C@@H](NC(=O)": 781,
    "n2C": 782,
    "c5ccc(": 783,
    "c2cccnc2": 784,
    "NC(=O)[C@H](CC(=O)O)": 785,
    "co": 786,
    ")C1CC": 787,
    "c4n": 788,
    "CC3": 789,
    "cn1)": 790,
    "c3)CC": 791,
    "COc1ccc(": 792,
    "sc2": 793,
    "CN=C(N)N)": 794,
    "CN(C)": 795,
    "2)c1C": 796,
    "(F)(F)": 797,
    "[C@H](C)[C@H](": 798,
    "3c2": 799,
    "o1": 800,
    "(CO": 801,
    "O[C@H](C": 802,
    "C2(CC": 803,
    "c1cc(-": 804,
    "[C@@H]2CC": 805,
    "c4c(": 806,
    "5)CC": 807,
    "c3ccncc": 808,
    "c2C": 809,
    "NC(=O)[C@H](Cc1ccccc1)": 810,
    "[C@H](CO)[C@@H](O)": 811,
    "N)n": 812,
    "N#C": 813,
    "3)o": 814,
    "c1cc(Cl)cc": 815,
    "c2ccc3c(": 816,
    "C4": 817,
    "O)c(": 818,
    "c1ccc(F)cc": 819,
    "o2)": 820,
    "2(CC": 821,
    "c1OC": 822,
    "COc1cc": 823,
    "C(=O)N[C@@H](CC(N)=O)": 824,
    "c2cccc(Cl)": 825,
    "c(OC": 826,
    "1Cc1ccc(": 827,
    "cccc4": 828,
    "CCN(C(=O)": 829,
    "c1ccc(Cl)": 830,
    "CCNCC": 831,
    "c1)N": 832,
    "C(=O)N[C@@H](CC(=O)O)": 833,
    "1CCN(C": 834,
    "(CCN": 835,
    "2)o": 836,
    "CNC": 837,
    "c1cnc[nH]": 838,
    "SC)": 839,
    "ccc(N": 840,
    "SSC": 841,
    "ccc(CN": 842,
    "1CS": 843,
    "ccc(-": 844,
    "c2ncc": 845,
    "c2ccccc2)C": 846,
    "n1cc": 847,
    "c2ccc(O": 848,
    "c2cc(C": 849,
    "c1C(=O)N": 850,
    "c1F": 851,
    "2)CC1CC": 852,
    "c1cccnc1": 853,
    "c1ccccc1C": 854,
    "=CC": 855,
    "n2cc(": 856,
    "c3)cc": 857,
    "cn3": 858,
    "c1ccc(Cl)cc1": 859,
    "[C@@H](CO": 860,
    "C(=O)N2C": 861,
    "(OC)": 862,
    "c2nc(N": 863,
    ")cc1-": 864,
    "2)ccc1": 865,
    "c3ccc(C": 866,
    "c2cc(Cl)cc": 867,
    ".[Na+]": 868,
    "c(C(F)(F)F)": 869,
    "c2F)": 870,
    "c1cc(C)": 871,
    "c1ccc2c(c1)": 872,
    "c1ccccc1)N": 873,
    "2CCN(CC": 874,
    "2CCN(C(=O)": 875,
    "F)cn": 876,
    "OC(C)": 877,
    "ccncc": 878,
    "3)s": 879,
    "NC(=O)[C@@H](CC": 880,
    "c2c(c1": 881,
    "1CN(": 882,
    "c4ccc": 883,
    "F)C": 884,
    "nc(NC": 885,
    "-c2cc(": 886,
    "3CCC(": 887,
    "[C@@H](CO)": 888,
    "c3ccccc23)": 889,
    "c1cc(C(=O)N": 890,
    "N=": 891,
    "c1ccc(C2": 892,
    "O[C@@H]3": 893,
    "[O-])": 894,
    "OCC(=O)N": 895,
    "C(F)F)": 896,
    "cn1C": 897,
    "c(CN": 898,
    "c2ccc(Cl)cc2)": 899,
    "c1ccc(-c2": 900,
    "1Cl": 901,
    "c(N2CC": 902,
    "c(C#N)": 903,
    "3)c(": 904,
    "1CC(C)C": 905,
    "[nH]2)": 906,
    "3F)": 907,
    "[C@@]3": 908,
    "ccc(N)": 909,
    "#N)cc": 910,
    "1-": 911,
    "-c1ccc(": 912,
    "1COc1ccc(C": 913,
    "-c1cc": 914,
    "c1ccc(F)cc1": 915,
    "C(C)CC": 916,
    "c2ncc(": 917,
    "c1cc2c(": 918,
    "[C@@H]2O": 919,
    "[C@@H](C)CC)": 920,
    "2)N": 921,
    "c2cccc(F)": 922,
    "(C)c2": 923,
    "2)n1C": 924,
    "OC)c1": 925,
    "1)c1ccccc1": 926,
    "C(=O)N[C@@H](Cc1c[nH]": 927,
    "1CN(C)": 928,
    "C(=O)N1CCC[C@H]1": 929,
    "C(=O)N[C@@H](": 930,
    "[C@]3": 931,
    "-c2ccccc2": 932,
    "ccco": 933,
    "CO)": 934,
    "c1c[nH]c2ccccc12)": 935,
    "cccs": 936,
    "N(C)C": 937,
    "c3[nH]": 938,
    "C)CC": 939,
    "4c3": 940,
    "c1=": 941,
    "cccnc3": 942,
    "c3cccc4": 943,
    "c1=O": 944,
    "c1ccc(CN": 945,
    "OC(=O)N": 946,
    "1Cc1cc(": 947,
    "c1cc(F)cc": 948,
    "C(=O)N(C)": 949,
    "1)CC": 950,
    "c4ccc(F)cc": 951,
    "(CC)": 952,
    "O)[C@H]": 953,
    "CCN1": 954,
    "Oc2ccc(": 955,
    "(C(=O)O)": 956,
    "c1cccc(Cl)": 957,
    "/C=C": 958,
    "NC(=O)[C@H](CC(N)=O)": 959,
    "(O)C": 960,
    "3)c2)": 961,
    "[C@@](C)": 962,
    "nc(CN": 963,
    "OP(=O)": 964,
    "c1ccc(F)": 965,
    "2)c1CO": 966,
    "C(=O)Nc2ccc(": 967,
    "O2)": 968,
    "c3ccccc2": 969,
    "c2n1CC": 970,
    "FC(F)(F)": 971,
    "Cl)CC": 972,
    "c12CO": 973,
    "c5ccccc": 974,
    "c3ncc": 975,
    "2=N": 976,
    "NC(=O)CC": 977,
    "(CCC": 978,
    "[C@H]3CC": 979,
    "2=O)": 980,
    "2CCCN2C(=O)": 981,
    "c1cccc(F)": 982,
    "c1cs": 983,
    "c3ccc(-": 984,
    "oc(-": 985,
    "(=O)=O)cc": 986,
    "3C)": 987,
    "Cl)c2": 988,
    "c(=O)[nH]c(N)": 989,
    "(C#N)": 990,
    "c1ccc(-c2ccccc2": 991,
    "2CC(C)": 992,
    "[C@H](O)[C@H]": 993,
    "C[C@@H](": 994,
    "C[C@H]2": 995,
    "F)cc3": 996,
    "4)CC3)": 997,
    "(=O)NC": 998,
    "c2c1C": 999,
    "4CCC": 1000,
    "sc1": 1001,
    "c3)C": 1002,
    "c1s": 1003,
    "1O=C(N": 1004,
    "c3ccccc3)n": 1005,
    "3)n2)": 1006,
    ")n1": 1007,
    "OC1": 1008,
    "O=C(C": 1009,
    "2O": 1010,
    "c4ccccc3": 1011,
    "c1cccc(CN": 1012,
    "CCC3)": 1013,
    "1)c1ccc(": 1014,
    "c5ccccc5": 1015,
    "c2nc(-c3": 1016,
    "c3ncn": 1017,
    "3)[nH]": 1018,
    "1CC(C)(C)": 1019,
    "[C@H]3C": 1020,
    "O=C(O)C(F)(F)F": 1021,
    "N1CCN(": 1022,
    "c3cccnc3": 1023,
    "c1cnc(N": 1024,
    "c1n[nH]": 1025,
    "c1)CC": 1026,
    "c2ccc(OC": 1027,
    "cc(C(=O)N": 1028,
    "(=O)N1CC": 1029,
    "4)cc3": 1030,
    "cnc": 1031,
    "2)no": 1032,
    "C(O": 1033,
    ")c1": 1034,
    "c1ccc2[nH]": 1035,
    "Oc3ccc(": 1036,
    "c4ccc(Cl)cc": 1037,
    "2)c1CC": 1038,
    "cc(O)": 1039,
    "c2nccc(": 1040,
    "1C(=O)N": 1041,
    "c2nc3ccccc3": 1042,
    "N1C": 1043,
    "O)[C@H](O)": 1044,
    "C(=O)N[C@H](C": 1045,
    "cc(NC(=O)": 1046,
    "O)cc(": 1047,
    "=O)[nH]": 1048,
    "ccccc3)": 1049,
    "OCC(C)": 1050,
    "OCC1": 1051,
    "Cc1ccc(": 1052,
    "6)": 1053,
    "C(=O)CC": 1054,
    "[C@H](O[C@@H]": 1055,
    "c1cccc(-": 1056,
    "c2ccc(F)cc2)": 1057,
    "c(-c2cc": 1058,
    "c(-n2": 1059,
    "s1)": 1060,
    "(CN2CC": 1061,
    "4CCCCC": 1062,
    "2)s": 1063,
    "ccc3c(": 1064,
    "nn2": 1065,
    "3=O)": 1066,
    "=O)C": 1067,
    "(F)(F)F)": 1068,
    "c2ccc(Cl)cc2": 1069,
    "c1ccncc": 1070,
    ")cc4": 1071,
    "NC(=O)[C@@H]1CCCN1C(=O)": 1072,
    "c4ccccc4)n": 1073,
    "c2cccc(C(F)(F)F)": 1074,
    "[C@@H](Cc1ccccc1)": 1075,
    "c2c(C": 1076,
    "c2cc(F)cc": 1077,
    "[C@@H](CC(C)C)": 1078,
    "2)cc1CO": 1079,
    "O3)": 1080,
    "2)nc1": 1081,
    "c1cccc(C(F)(F)F)": 1082,
    "OC(F)(F)F)cc": 1083,
    "c2ccccn2)": 1084,
    "c(N3CC": 1085,
    "c2ccc(-": 1086,
    "O)O[C@@H](": 1087,
    "c1ccc2c(c1": 1088,
    "O=C(NCC": 1089,
    "ccnc2": 1090,
    "3)c2c1": 1091,
    "c2cc(N": 1092,
    "CCCO": 1093,
    "OC)c(OC)": 1094,
    "c3ccc(N": 1095,
    "c(NC(=O)": 1096,
    "1CNC(=O)": 1097,
    "2O=C(": 1098,
    "Sc1n": 1099,
    "c1ccc(-c2cn": 1100,
    "/C=C/": 1101,
    "c1O=C(": 1102,
    "c1nc": 1103,
    "c1ccccc1CO": 1104,
    "oc2": 1105,
    "n2)cc1C": 1106,
    "ccccn": 1107,
    "N#Cc1": 1108,
    "c4c3": 1109,
    "c2n1": 1110,
    "n3)C": 1111,
    "cnc5": 1112,
    "1O=C(O)": 1113,
    "c(c3)": 1114,
    "c1cc(NC(=O)": 1115,
    "c(Nc3ccc(": 1116,
    "CCOCC": 1117,
    "-c2ccc3": 1118,
    "O=C(Nc1ccc(": 1119,
    "4)cn": 1120,
    "c2o": 1121,
    "=C1": 1122,
    "P(=O)(": 1123,
    ")cc1)N": 1124,
    ")CC2": 1125,
    "NC(=O)[C@@H](N)C": 1126,
    "N)N": 1127,
    "[C@@H](N)": 1128,
    "C(=O)N[C@H]": 1129,
    "1C[C@H](": 1130,
    "c3ccc(-c4": 1131,
    "[C@](C)": 1132,
    "C(=O)OCC": 1133,
    "Cl)cc(": 1134,
    "3CCN(": 1135,
    "c3ccc(O)cc": 1136,
    "c2ccc(NC(=O)": 1137,
    "c(C)cc": 1138,
    "3O": 1139,
    "c2ccc(O)cc2)": 1140,
    "C(C)C)C(C)C)": 1141,
    "1COc1ccccc1": 1142,
    "CN1C(=O)": 1143,
    "Oc1": 1144,
    "C(N)=N": 1145,
    "c1ccccc1CC": 1146,
    "OCCC": 1147,
    "ncc3": 1148,
    "c1ccccc1)C": 1149,
    "nn[nH]": 1150,
    "4)ccc3": 1151,
    "3CO": 1152,
    "1CN(C": 1153,
    "1Cc1ccccc1": 1154,
    "C(N)=O": 1155,
    "c2ccccc2)cc": 1156,
    "NC(": 1157,
    "n2nc(": 1158,
    "n1cc(-c2": 1159,
    "c(-c3cccc": 1160,
    "1)N1CC": 1161,
    "CN1CCN(": 1162,
    "(C)cc": 1163,
    "CCC2": 1164,
    ")C(=O)": 1165,
    "1)C(=O)N": 1166,
    "2n": 1167,
    "[C@H](C)C": 1168,
    "NC2": 1169,
    "OC[C@H]3": 1170,
    "F)cc3)": 1171,
    "O)cc1)": 1172,
    "C)C": 1173,
    "C)cc": 1174,
    "[C@H]2O)": 1175,
    "2)n1CC": 1176,
    "c1c(C": 1177,
    "c2ccc3ccccc3": 1178,
    "c2c(=O)": 1179,
    "c4=O)": 1180,
    "c2cs": 1181,
    "=C2": 1182,
    "c3ccccc3)C": 1183,
    "c2cccc(-c3": 1184,
    "c1c(-": 1185,
    "s3)": 1186,
    "Cl)cn": 1187,
    "c1ccc2n": 1188,
    "=NCCN": 1189,
    "n5": 1190,
    "2CCCC2)": 1191,
    "CN1C": 1192,
    "CCCCC": 1193,
    "c1ccc(CN2CC": 1194,
    "n2c(": 1195,
    "N1CCC(": 1196,
    "N)ncn": 1197,
    "c2ccc(Cl)": 1198,
    "1COC": 1199,
    "C(=O)N[C@H]1CC": 1200,
    "nc(-c3": 1201,
    "-c2cn": 1202,
    "Cl)ccc2": 1203,
    "=C(N)": 1204,
    "N(c2n": 1205,
    "c1nc(C": 1206,
    "oc(C": 1207,
    "3)CC2)cc": 1208,
    "Cc1cn": 1209,
    "C(=O)NCC(=O)N[C@@H](CC": 1210,
    "c2cc(C(F)(F)F)cc": 1211,
    "c32)": 1212,
    "c2ccccc2n": 1213,
    "c2c1CC": 1214,
    "Oc1ccc(N": 1215,
    "3CCOCC3)": 1216,
    "2)cc1)": 1217,
    "NC(=O)[C@H](Cc1c[nH]": 1218,
    "C[C@@H]1": 1219,
    "1Cc1cn": 1220,
    "(C)N": 1221,
    "C(=O)N[C@@H](Cc1ccc(O)cc1)": 1222,
    "Oc1cc2": 1223,
    "-c2n": 1224,
    "F)c(F)": 1225,
    "c2ncccc2": 1226,
    "(CC(C": 1227,
    "[C@@H](N)C": 1228,
    "c2ccccc2)cc1": 1229,
    "4)nc3": 1230,
    "Cl)C": 1231,
    "O)cc2)": 1232,
    "[C@H](NC(=O)[C@H](C": 1233,
    "c3ccccc3)cc": 1234,
    "n3cc": 1235,
    "c3cccc(Cl)": 1236,
    "CN(C)C": 1237,
    "3CCN(C": 1238,
    "c1cccn": 1239,
    "[C@H](O)[C@@H](O)": 1240,
    "c23)cc": 1241,
    "1CCN(C(=O)": 1242,
    "3CN": 1243,
    "ncc4": 1244,
    "(NC(=O)": 1245,
    "C(=O)N(": 1246,
    "[nH]c1": 1247,
    "c2cc(NC(=O)": 1248,
    "c3nn": 1249,
    "[C@@H]3O": 1250,
    "NC(=O)c2": 1251,
    "2C1": 1252,
    "[nH]c4": 1253,
    "c(N)ncn": 1254,
    "Cl)cc3": 1255,
    "c2ccccc2)N": 1256,
    "3)C2)": 1257,
    "(NC": 1258,
    "C(=O)N[C@H](CC": 1259,
    "S(N)": 1260,
    "1(C)": 1261,
    "C(N)=O)C(C)C)": 1262,
    "c3s": 1263,
    "C(CN": 1264,
    "C(F)(F)F)cc1": 1265,
    "c1nc2ccccc2": 1266,
    "c4cccc(": 1267,
    "1F": 1268,
    "[C@@H](C(=O)O)": 1269,
    "c(-c3cn": 1270,
    "[C@H]5": 1271,
    "5)C": 1272,
    "Cc1n": 1273,
    "c1=OC": 1274,
    "n3)cc": 1275,
    ")N1C": 1276,
    "[C@]4": 1277,
    "NC(=O)[C@H]([C@@H](C)O)": 1278,
    "[C@H](C(=O)O)": 1279,
    "cc4": 1280,
    "2=": 1281,
    "c1nc(N)": 1282,
    "C(=O)N[C@@H](CCCCN)C(=O)N[C@@H](CCCCN)": 1283,
    "n1)N": 1284,
    "2CC3CC": 1285,
    "c1ccc2ccccc2": 1286,
    "S(C)(=O)=O)": 1287,
    "c1CC(C)": 1288,
    "cnn(C)": 1289,
    "1Cc1cc(N": 1290,
    "c4ccc5": 1291,
    "C(=O)N[C@@H](CCCCN)C(=O)N[C@@H](CC(C)C)": 1292,
    "C(=O)Cn2": 1293,
    "COC": 1294,
    "[C@@H](C(=O)N": 1295,
    "-c1n": 1296,
    "ccc(=O)": 1297,
    "c1o": 1298,
    "c1N1CC": 1299,
    "c1cnc[nH]1)": 1300,
    "[C@@H](C)C": 1301,
    "O)cc2": 1302,
    "CCN(C)CC": 1303,
    "c(-c3ccccc3)": 1304,
    "S(=O)(=O)O)": 1305,
    "NC1=": 1306,
    "[C@@]4": 1307,
    "c(-c4ccc(": 1308,
    "c2ncnc3": 1309,
    "CCC(": 1310,
    "1OC)": 1311,
    "O[C@@H](n4": 1312,
    "ccc1": 1313,
    "NC(=O)[C@H](Cc1ccc(O)cc1)": 1314,
    "c3ccccc3)CC": 1315,
    "2CC(=O)N": 1316,
    "c3ccccc3C": 1317,
    "CN)": 1318,
    "FC": 1319,
    "c3c[nH]": 1320,
    "n1)C": 1321,
    "4)c3)": 1322,
    "c3c2)": 1323,
    "1C[C@@H](": 1324,
    "C(F)(F)F)cc(C(F)(F)F)": 1325,
    "2CCCCC2)": 1326,
    "OC2": 1327,
    "-c4cn": 1328,
    "[C@@H]3CC": 1329,
    "c1ccccc1Cl": 1330,
    "NC(=O)[C@@H](N)CC": 1331,
    "c1c(O)": 1332,
    "4)cc2": 1333,
    "N(C)C(=O)": 1334,
    "c2ccc(C(=O)N": 1335,
    "c1Cn1": 1336,
    "CCC2)": 1337,
    "cc(C)c(=O)[nH]": 1338,
    ")cc1)": 1339,
    "C(=O)N[C@@H](CCCN=C(N)N)": 1340,
    "c2c(Cl)": 1341,
    "c1ccc(-c2cc(": 1342,
    "CCN1C(=O)": 1343,
    "COc1cc(": 1344,
    "c(=O)n(C)": 1345,
    "cn1CC": 1346,
    "1Cc1cc(C)": 1347,
    "F)ccc2": 1348,
    "Cl)ccc3": 1349,
    "[C@H](CC(C)C)": 1350,
    "cc(-c4": 1351,
    "c2cccc(N": 1352,
    "(CC(=O)O)": 1353,
    "[nH]3)": 1354,
    "c2nc(C": 1355,
    "OC[C@H]2": 1356,
    "nc2c1": 1357,
    "c2ccc(F)": 1358,
    "c2-c2": 1359,
    "ClC": 1360,
    "c(-c3cc": 1361,
    ")CC3)": 1362,
    "c3cc(-c4": 1363,
    "-2": 1364,
    "nc(C(=O)N": 1365,
    "cn3)": 1366,
    "(O)(": 1367,
    "cnc(N)": 1368,
    "n2cnc3": 1369,
    "1N#": 1370,
    "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](CCCNC(=N)N)": 1371,
    "c1cc(-c2ccc(": 1372,
    "NC(=O)[C@H](Cc2ccccc2)": 1373,
    "CCCCCC": 1374,
    "c(C)c1": 1375,
    "c7": 1376,
    "c(OCC": 1377,
    "NC(=O)CNC(=O)[C@H](CC": 1378,
    "nc(NC(=O)": 1379,
    "3CC4CC": 1380,
    ")[C@@H]": 1381,
    "4=O)": 1382,
    ")C2)": 1383,
    "1CCOCC": 1384,
    "C(=O)N(C": 1385,
    "4c(": 1386,
    "c2c(C)": 1387,
    "C(N)=O)c(N": 1388,
    "n2C)": 1389,
    "=OCO": 1390,
    ")cc1Cl": 1391,
    "[nH]c2c1": 1392,
    "c2ccc(F)cc2": 1393,
    "sc3": 1394,
    "[C@H]2O": 1395,
    "1COc1cc2": 1396,
    "1CN(CC": 1397,
    "c(NCC": 1398,
    "c3cccc(F)": 1399,
    "c3nc4ccccc4": 1400,
    "c2c1CO": 1401,
    "c2ccccc12": 1402,
    "1NC(=O)": 1403,
    "c2nc(-c3ccc(": 1404,
    "S1": 1405,
    "CC(=O)O)": 1406,
    "c1nnc(-": 1407,
    "(=S)": 1408,
    "c1ccc(Nc2n": 1409,
    "nc(O)": 1410,
    "C(=O)N1": 1411,
    "c2ccc3c(c2)": 1412,
    "3CCCN": 1413,
    "3)nn": 1414,
    "cc(C(F)(F)F)": 1415,
    "C)cn": 1416,
    "3C[C@H](": 1417,
    "n1ncc": 1418,
    "c2cccn": 1419,
    "C(=O)NCC(=O)N[C@@H](C": 1420,
    "c1ccc(Br": 1421,
    "Nc1ncn": 1422,
    "[C@@H]3C": 1423,
    "c2c(F)": 1424,
    "n2)c1": 1425,
    "c2cc3c(": 1426,
    "c(S": 1427,
    "c2c[nH]c3ccccc23)": 1428,
    "(C)C)cc": 1429,
    "c1nn(C": 1430,
    "4CC4)": 1431,
    "S(=O)(=O)C": 1432,
    "c2nc3c(": 1433,
    "ncnc(N": 1434,
    "cccnc2": 1435,
    "2CCOCC2)": 1436,
    "[C@H](O)C": 1437,
    "c1c(C)": 1438,
    "O[C@@H]4": 1439,
    "c(-c5": 1440,
    "O)cc1": 1441,
    "[C@H]1CN": 1442,
    ")cc(OC)": 1443,
    "2CC(": 1444,
    "C(=O)N(C)C": 1445,
    "c2ccc(C(F)(F)F)cc": 1446,
    "(C)c3": 1447,
    "-c5": 1448,
    "CC(C)(C)": 1449,
    "c(C)n": 1450,
    "O[C@H](CO)[C@@H](O)[C@H](O)": 1451,
    "C(F)(F)F)cn": 1452,
    "1)C(=O)": 1453,
    "C(=O)N(CC": 1454,
    "c2C)": 1455,
    "C(CO)": 1456,
    "on": 1457,
    "(O)(C": 1458,
    "c2)cn": 1459,
    "c1cc(OC": 1460,
    "3)cc1C": 1461,
    "(=O)N[C@@H](CC": 1462,
    "(-c2ccc(": 1463,
    "c2ccccc2F)": 1464,
    "C(=O)N[C@@H](Cc1c[nH]c2ccccc12)": 1465,
    "3CCN(C(=O)": 1466,
    "c1nc2cc(": 1467,
    "1Cc2ccccc2": 1468,
    "c1ccc(Cn2": 1469,
    "n2)n": 1470,
    "c5)": 1471,
    "O[C@@H](n": 1472,
    "[C@@H](C)O": 1473,
    "N2CCC(": 1474,
    "c2cc(C(=O)N": 1475,
    "C[C@@H]2": 1476,
    "-c3cn": 1477,
    "C(NC(=O)": 1478,
    "NC1CC": 1479,
    "OP(O)": 1480,
    "[C@H](C)[C@@H]1": 1481,
    "[C@H](O)[C@H](O)": 1482,
    "CC1)": 1483,
    "n2cc": 1484,
    "=C(C)": 1485,
    "c(C)nn": 1486,
    "NC1=O": 1487,
    "NC(C)": 1488,
    "[C@@H]1OC": 1489,
    "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](CC(C)C)": 1490,
    "NC(=O)[C@H](CCN)": 1491,
    "C(N)=OC": 1492,
    "(C2CC": 1493,
    "3(CC": 1494,
    "NC(=O)CN(CC": 1495,
    "3)CC2)cc1": 1496,
    "C(=O)N[C@@H](Cc1ccccc1)C(=O)N[C@H](": 1497,
    "cc(Cl)cc": 1498,
    "C)n": 1499,
    "n3cn": 1500,
    "(=O)O": 1501,
    "cccc(N": 1502,
    "3)no": 1503,
    "ccccc6": 1504,
    "Oc2ccccc2": 1505,
    "c2ccc(Br": 1506,
    "nc(S": 1507,
    "C3(CC": 1508,
    "C(=O)N1CCC(": 1509,
    "(C)c(=O)": 1510,
    "c(-c2ccccc2": 1511,
    "n1)CC": 1512,
    "1COc1ccc(-": 1513,
    "c4[nH]": 1514,
    "c1ccc(CC": 1515,
    "c1ccccn1": 1516,
    "n1O=C(": 1517,
    "3CCN(CC": 1518,
    "c3ccccc3)CC2)": 1519,
    "c(-c2cn": 1520,
    "C(N)=O)cc": 1521,
    "(C2": 1522,
    "c3ccccn": 1523,
    "c1cn(C": 1524,
    "c1ccc(-c2ccc(": 1525,
    "3)n2)c1": 1526,
    "-c2cc": 1527,
    "5C": 1528,
    "O=c1[nH]": 1529,
    "[C@@H]5": 1530,
    "1CC(": 1531,
    "/C=": 1532,
    "c2c(-": 1533,
    "cccnc4": 1534,
    "-n3": 1535,
    "O=C1CC": 1536,
    "c1NC(=O)": 1537,
    "NC(=O)c2ccc(": 1538,
    "N)C(=O)N": 1539,
    "c3C": 1540,
    "c1nc(C)": 1541,
    "OC1CC": 1542,
    "n2)CC": 1543,
    "4C)": 1544,
    "ccccc1": 1545,
    "N1CCOCC": 1546,
    "CC(N)=O)": 1547,
    "ccc(F)cc": 1548,
    "cc(CN": 1549,
    "2)CC1CO": 1550,
    ".O=C(O)C(F)(F)F.O=C(O)C(F)(F)F": 1551,
    "c(NC(=O)N": 1552,
    "2C)": 1553,
    "(C)(C)O": 1554,
    "ccc3[nH]": 1555,
    "s1C": 1556,
    "=O)[C@@H]": 1557,
    "c3ccc4c(": 1558,
    "nc(N2CC": 1559,
    "c3ccc4ccccc4": 1560,
    "N1CCN(C": 1561,
    "ccc(Cl)cc": 1562,
    "2(": 1563,
    "S)O[C@@H]": 1564,
    "c2n[nH]": 1565,
    "c3cc(Cl)": 1566,
    "c1cc(C(F)(F)F)cc": 1567,
    "n3C)": 1568,
    "c2ccc(Cl)c(Cl)": 1569,
    "n2-": 1570,
    "(C)CCN": 1571,
    "c(=O)c(C(=O)O)": 1572,
    "O=C1N": 1573,
    "c2ccc3[nH]": 1574,
    "c(=O)n2": 1575,
    "NC(=O)[C@@H](N)": 1576,
    "nn1": 1577,
    "F)CC": 1578,
    "c4ccc(O)cc": 1579,
    "NC(C)=O)": 1580,
    "c4)CC": 1581,
    "Oc1ccccc1": 1582,
    "NC(=O)c1cn": 1583,
    "[nH]c(C": 1584,
    "3)cc2)n": 1585,
    "c1ccccc1N1CC": 1586,
    "[nH]c(": 1587,
    "c2c(N": 1588,
    "C3CC": 1589,
    "c(Br)": 1590,
    "[C@H](C(=O)N": 1591,
    "[C@H]6": 1592,
    "c3ccc(O": 1593,
    "ccs": 1594,
    "c(=O)n(C": 1595,
    "NC(=O)[C@H](CCCN=C(N)N)": 1596,
    "5)c4": 1597,
    "O[C@@H]2": 1598,
    "c(F)cc": 1599,
    "c1ccc(Cl)c(Cl)": 1600,
    "[C@H](Cc1ccccc1)": 1601,
    "(-c2ccccc2)": 1602,
    "sc4": 1603,
    "F)cc(": 1604,
    "O[C@@H]6": 1605,
    "(C(=O)C": 1606,
    ")N(": 1607,
    "c1cccc2c1": 1608,
    "c3c(F)": 1609,
    ")cc(C)": 1610,
    "F)c(=O)": 1611,
    "c1ccc2cc(": 1612,
    "o2)cc": 1613,
    "C(c2ccccc2)": 1614,
    "cn4": 1615,
    "c(C(N)=O)": 1616,
    "CC(O)": 1617,
    "2)C1CC": 1618,
    "4)s": 1619,
    "c3ccs": 1620,
    "cc(OC)": 1621,
    "c1=O)": 1622,
    "[C@H](NC(=O)[C@H](CC": 1623,
    "c2N": 1624,
    "c(n2)": 1625,
    "c2cc(-c3ccc(": 1626,
    "ccc4c(": 1627,
    "cccc3F)": 1628,
    "c(cc2": 1629,
    "3)CC2)n": 1630,
    "cnn2": 1631,
    "3CCCCC3)": 1632,
    "nc1-": 1633,
    "C2)cc1": 1634,
    "S(=O)(=O)N": 1635,
    "C(=O)N[C@H](C(=O)N[C@H](": 1636,
    "1OC": 1637,
    "c(-c2ccccc2)": 1638,
    "c4ccc(C": 1639,
    "Nc1nc(": 1640,
    "CN3": 1641,
    "[C@H]1CO": 1642,
    "CCN1C": 1643,
    "CCN(C)": 1644,
    "c1ccc(Cl)cc1)": 1645,
    "2CCN(c3n": 1646,
    "o1C": 1647,
    "c1Cc1": 1648,
    "F)(": 1649,
    "CN(C)CC": 1650,
    "c1nc2cccc": 1651,
    "C(=O)N1)": 1652,
    "OCC(O)": 1653,
    "/C(=": 1654,
    "c1cccc(Cl)c1": 1655,
    "nc(C(F)(F)F)": 1656,
    "OCc1ccccc1": 1657,
    "2)[C@H](O)": 1658,
    "5CCOCC": 1659,
    "F)ccc3": 1660,
    "3CCN(C)CC": 1661,
    "cc2c(": 1662,
    "C1(": 1663,
    "NC(=O)[C@H](Cc2c[nH]": 1664,
    "c1cncc(": 1665,
    "c4ccccc4)CC": 1666,
    "1CN(C)CC": 1667,
    "3)c2)n": 1668,
    "4)o": 1669,
    "c2ccc(C#N": 1670,
    "C(=O)N2": 1671,
    "N(C)C)": 1672,
    "NC(=O)[C@H](Cc1c[nH]c2ccccc12)": 1673,
    "=OCOc1cc": 1674,
    "c2cccc(-": 1675,
    "C3)n": 1676,
    "c2cc(C)": 1677,
    "NC(=O)[C@H](CO)NC(=O)[C@@H](": 1678,
    "ccc4[nH]": 1679,
    "c1c(F)": 1680,
    "[C@H]4CC": 1681,
    "3CCNCC": 1682,
    "C(F)(F)F)n": 1683,
    "NC(=O)[C@@H]2CCCN": 1684,
    "[C@H]3O)": 1685,
    "1CC1)": 1686,
    "oc3": 1687,
    "c(-c2ccc3": 1688,
    "c1cnn2": 1689,
    "NC1=N": 1690,
    "OC(F)(F)F)": 1691,
    "c2ccs": 1692,
    "n2ccc(": 1693,
    "[C@H](CCCCN)": 1694,
    "c1ncccc1": 1695,
    "CCN2CC": 1696,
    "c1cccc(O": 1697,
    "c2ccc(-c3ccc(": 1698,
    "c1nc2": 1699,
    "(-c2ccccc2)n": 1700,
    "-c3cc": 1701,
    ".[Na+].[Na+]": 1702,
    "2)N1CC": 1703,
    "c1ccc(-c2cc": 1704,
    "NC(=O)CO": 1705,
    "c1ccc(C(=O)N2CC": 1706,
    "NC(=O)[C@@H]2CCCN2C(=O)": 1707,
    "c1cccs": 1708,
    "c2no": 1709,
    "N1C(=O)": 1710,
    "2Cl": 1711,
    "c1ccc(C)": 1712,
    "c4ccccc4)cc": 1713,
    "c1cccc2cccc": 1714,
    "/c(": 1715,
    "ncs": 1716,
    "OC(C)(C)C)": 1717,
    "o3)": 1718,
    "nc(N3CC": 1719,
    "C[C@H]3": 1720,
    "O[C@@H](n3": 1721,
    "C1=O": 1722,
    ")cc1F": 1723,
    "O)ccc3": 1724,
    "nn3": 1725,
    "(c2ccccc2)": 1726,
    "nc3)": 1727,
    "c1CC(=O)N": 1728,
    "[C@H]1OC": 1729,
    "OCCOCCOCCOCC": 1730,
    "c2)c1C": 1731,
    "FCO": 1732,
    "C(OC": 1733,
    "c2cccc(O": 1734,
    "2c(cc": 1735,
    "c3cc(C": 1736,
    "OC[C@H]1O": 1737,
    "CC2)cc": 1738,
    "c2ccc(-c3ccccc3": 1739,
    "c1cccc(C(=O)N": 1740,
    "n3C": 1741,
    "c1ccc(OCC": 1742,
    "1)c1cc": 1743,
    "ccc(-c2": 1744,
    "4CC4)n": 1745,
    "c2ccccc2-c2": 1746,
    "CCNC": 1747,
    "c(-c4cn": 1748,
    ".ClC": 1749,
    "(=O)N[C@@H](C": 1750,
    "(N2CC": 1751,
    "c1ccco": 1752,
    "c1cn(": 1753,
    "nc(NCC": 1754,
    "O[C@H](CO)[C@@H](O)": 1755,
    "c1nc(-c2ccc(": 1756,
    "[C@H](N)C": 1757,
    "c1cc(O)": 1758,
    "1CC[C@H](C)": 1759,
    "3c(": 1760,
    "2CCC(N": 1761,
    "c3ccc(F)cc3)": 1762,
    "[C@H]1CN(": 1763,
    "(CCO)": 1764,
    "3)cc2)cc": 1765,
    "O[C@@H]5": 1766,
    "c2cccs": 1767,
    "c2ccccc2)c1": 1768,
    "[C@H](C)CC": 1769,
    "Br)cc2": 1770,
    "c2nnn": 1771,
    "c3c(C)": 1772,
    "[C@@H]4CC": 1773,
    "=NCC": 1774,
    "C)c1": 1775,
    "C(=O)N[C@H](C(=O)N[C@@H](CC": 1776,
    "c1ccc(O[C@@H]": 1777,
    "[C@H](NC(=O)CNC(=O)": 1778,
    "(c3ccc(": 1779,
    "(C)C[C@H](": 1780,
    "[C@@H](C(N)=O)": 1781,
    "c(Cl)c1": 1782,
    "1COc1cccc(": 1783,
    "cc3c(": 1784,
    "CC(C": 1785,
    "NS(=O)(=O)": 1786,
    "c4ccc(-": 1787,
    "NC(=O)[C@H](C(C)C)": 1788,
    "c1ccc(O)cc1)C(=O)N[C@@H](Cc1ccccc1)": 1789,
    "CN1CCC(": 1790,
    "C(O)C": 1791,
    "nn(C)": 1792,
    "c1ccc(O)": 1793,
    "2)cc1COc1cc": 1794,
    "C(=O)N[C@@H](C)C(=O)N[C@@H](CCCCN)": 1795,
    "c2cn(": 1796,
    "O=S(=O)": 1797,
    "c2cc1O": 1798,
    "c1CN1CC": 1799,
    "-c1ccccc1": 1800,
    "NC1=OC": 1801,
    "cn(C": 1802,
    "N[C@@H](C)": 1803,
    "c3ccc(F)cc3": 1804,
    "c3ncc(": 1805,
    "oc(": 1806,
    "c2cnc(N": 1807,
    "cc(OC": 1808,
    "CC(N)": 1809,
    "2C[C@H](": 1810,
    "O[C@H]2C": 1811,
    "NCCC": 1812,
    "c3ccc(C(F)(F)F)cc": 1813,
    "C(=O)N[C@@H](CCC(N)=O)C(=O)N[C@@H](CO)": 1814,
    "1=OCC": 1815,
    "N2C": 1816,
    "NC(=O)CNC(=O)[C@@H](": 1817,
    "(S(=O)(=O)": 1818,
    "(C)CCC": 1819,
    "cnc1": 1820,
    "s1CC": 1821,
    "C(C)C)C(": 1822,
    "1CN(C)C": 1823,
    "3)O": 1824,
    "C(c1ccccc1)": 1825,
    "NC3": 1826,
    "2CN(": 1827,
    "(O)CC": 1828,
    "c3nc(": 1829,
    "c2)N": 1830,
    "c2ccco": 1831,
    "C(=O)N[C@H](C)": 1832,
    "(CCCC": 1833,
    "c1cc(Cl)": 1834,
    "(C)C(=O)N": 1835,
    "n12": 1836,
    "C(F)(F)F)cc2": 1837,
    "c3nccc(": 1838,
    "c1nn(": 1839,
    "CCC4": 1840,
    "c3)c2": 1841,
    "1)C1CC": 1842,
    "c1nccc(": 1843,
    "C(N)=": 1844,
    "c1Cc1n": 1845,
    "1COc1cc2c(": 1846,
    "S(C)(=O)=O)cc": 1847,
    "c2c(O)": 1848,
    "[nH]1": 1849,
    "c(C3": 1850,
    "2CCNCC2)": 1851,
    "2C[C@@H](": 1852,
    "[C@@H](O)C": 1853,
    "C(F)(F)F)cc2)": 1854,
    "c2ccccc2)c2ccccc2": 1855,
    "n1c(C": 1856,
    "cccn2)": 1857,
    "2)C1C": 1858,
    "3)nn2": 1859,
    "C(CO": 1860,
    "NC1=O)": 1861,
    "[C@@H](CCCNC(=N)N)": 1862,
    "CCn1": 1863,
    "1)c1cc(": 1864,
    "4F)": 1865,
    "4CCOC": 1866,
    "nc[nH]": 1867,
    "Sc2n": 1868,
    "NC(=O)c3ccc(": 1869,
    "c3=O)": 1870,
    "(C3": 1871,
    "C(=O)N[C@@H](CS)": 1872,
    "O)O[C@@H](n": 1873,
    "FCC": 1874,
    "Oc1n": 1875,
    "[C@H](CCCNC(=N)N)": 1876,
    "c3cc(F)": 1877,
    "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](C)": 1878,
    "3CC3)n": 1879,
    "n(-c2ccc(": 1880,
    "CNCC": 1881,
    "4CCOCC4)n": 1882,
    "1.O=C(O)C(F)(F)F": 1883,
    "3CCOCC3)n": 1884,
    "c2cc(F)": 1885,
    ".Cl.Cl": 1886,
    "c5cccc": 1887,
    "c2cccc(C": 1888,
    "c1cc(-c2n[nH]": 1889,
    "c2ccc(-c3ccccc": 1890,
    "c1cccc(O)": 1891,
    "[C@@H](O[C@H]": 1892,
    "1=O": 1893,
    "CCC(=O)N": 1894,
    "C(C(=O)N": 1895,
    "OCC2)": 1896,
    "c1ncc(-c2": 1897,
    "[C@@H](C)CC": 1898,
    "c5ccc": 1899,
    "c3c2)n": 1900,
    "1N=C(": 1901,
    "c2cc1OCC": 1902,
    "c2ncnc(N": 1903,
    "c1CCC": 1904,
    "C1=N": 1905,
    "(NC(=O)N": 1906,
    "c(=O)o": 1907,
    "2)cc1CC(C)": 1908,
    "nc(-c3ccc(": 1909,
    "c3ccccc3)c2": 1910,
    "c1ccc(S(=O)(=O)": 1911,
    "[C@@H](n2": 1912,
    "c1ccc(N2CC": 1913,
    "C(=O)N[C@H](C(=O)N[C@@H](C": 1914,
    "[nH]cc": 1915,
    "CC1)N": 1916,
    "c1cccc(CC": 1917,
    "c2nc3cc(": 1918,
    "sc(": 1919,
    "oc2c1": 1920,
    "[C@H](OC(=O)": 1921,
    "C2=O)": 1922,
    "c1cc(O": 1923,
    "n23)": 1924,
    "c1cc(OC)": 1925,
    "c3cc2": 1926,
    "2O=C(N": 1927,
    "c2cc(-": 1928,
    "/N": 1929,
    "[C@]12CC": 1930,
    "1O=C(NC": 1931,
    "c1ccccc1)N1CC": 1932,
    "4CCOCC4)": 1933,
    "F)c(Cl)": 1934,
    "(C)C)CC": 1935,
    "-3": 1936,
    "c3ccc(Cl)cc3": 1937,
    "Nc1cc": 1938,
    "O)cc3": 1939,
    "1Cc1ccc(N": 1940,
    "c1ccccc1F": 1941,
    "[C@H](NC(=O)[C@H](CC(C)C)": 1942,
    "c2ccccc2Cl)": 1943,
    "[C@@H]6": 1944,
    "CC2)n": 1945,
    "1COc1ccc(N": 1946,
    "c3cc4c(": 1947,
    "6CC": 1948,
    "c1ccc(S": 1949,
    "c1ccn2": 1950,
    "C3=O)": 1951,
    "C(=O)O)C": 1952,
    "c(C(=O)NC": 1953,
    "(-c3ccccc": 1954,
    "C(=O)O)c(=O)": 1955,
    "2CCC1CC": 1956,
    "n2c(=O)": 1957,
    "3)C2)n": 1958,
    "c1)N1CC": 1959,
    "nc(CC": 1960,
    "5CCCC": 1961,
    "3=": 1962,
    "=NC": 1963,
    "NC(=O)[C@@H](NC(=O)[C@@H](": 1964,
    "c3ccccc3F)": 1965,
    "cccc5": 1966,
    "[C@@H](COP(=O)(O)": 1967,
    "N)cc": 1968,
    "Cl)cc2)": 1969,
    "c1ccccc1CN": 1970,
    "c3ccccn3)": 1971,
    "C1CO": 1972,
    "1Cc1cc(C": 1973,
    "C(=O)N[C@@H](CCCNC(=N)N)C(=O)N[C@@H](CCCCN)": 1974,
    "N3CCCC": 1975,
    "[C@@H](O)CN": 1976,
    "cccc(Cl)": 1977,
    "c1O=C(N": 1978,
    "N(C(=O)N": 1979,
    "1CCCC1": 1980,
    "1N#C": 1981,
    "c21": 1982,
    "[C@@H]1CCCN1C(=O)": 1983,
    "1.Cl": 1984,
    "c1cc(CN": 1985,
    "s2)cc": 1986,
    "c3ccc(OC": 1987,
    "C(F)(F)F)CC": 1988,
    "c3nc(-c4": 1989,
    "2)cc2": 1990,
    "[C@@H](CO)O": 1991,
    "c3cccc(C(F)(F)F)": 1992,
    "c2cccc(Cl)c2)": 1993,
    "O)n": 1994,
    "c1ccc(F)cc1)": 1995,
    "cnc2c1ncn": 1996,
    "1CCn1": 1997,
    "c1c(Cl)": 1998,
    "N=C(N)": 1999,
    "c(CN2CC": 2000,
    "c2ccc(O)": 2001,
    "O=C1C": 2002,
    "C1N": 2003,
    "c2ccccc2C": 2004,
    "c2cc(Cl)ccc2": 2005,
    "nc3[nH]": 2006,
    "c1=OCC": 2007,
    "SCC(=O)N": 2008,
    "c(-c3ccc(Cl)cc": 2009,
    "c3ccc(Cl)cc3)": 2010,
    "1CN1C": 2011,
    "OC(C": 2012,
    "3)cc1CC": 2013,
    "c(-c3ccc(F)cc": 2014,
    "2)c(": 2015,
    "O[C@H](C)": 2016,
    "c3C)": 2017,
    "c(Cl)cccc1": 2018,
    "c(F)c2)": 2019,
    "[C@H](NC(=O)[C@@H](": 2020,
    "[C@@H](CCCCN)": 2021,
    "c4cccn": 2022,
    "CN2": 2023,
    "c1nn(C)": 2024,
    "2)cc(": 2025,
    "[C@H](C(C)C)": 2026,
    "c2nc(N)": 2027,
    "OC3": 2028,
    "1COc1cc(-c2": 2029,
    "c1c(C(=O)N": 2030,
    "[C@]1(": 2031,
    "ccnc3": 2032,
    "ccc(C)cc": 2033,
    "c-": 2034,
    "NC(=O)[C@H](CO)NC(=O)[C@H](C": 2035,
    "C(=O)N[C@@H](Cc1ccccc1)C(=O)N[C@@H](CCC(=O)O)": 2036,
    "-c3ccccc3": 2037,
    "c(C)c1CC": 2038,
    "1Cc1cc2": 2039,
    "#N)cc1": 2040,
    "P(=O)(O)O[C@H]": 2041,
    "[nH]ccc3": 2042,
    "c2cc3ccccc3": 2043,
    "c1cccc(NC(=O)": 2044,
    "c3nc(N": 2045,
    "COc1ccc(-": 2046,
    "2CCCO": 2047,
    "C(=O)Nc3ccc(": 2048,
    "n2ncc": 2049,
    "NC(=O)[C@@H]2C": 2050,
    "C(=O)N1CCN(": 2051,
    "n1O=C(N": 2052,
    "n2cc(-c3": 2053,
    "c(=O)c2": 2054,
    "COc1ccc(C": 2055,
    "c3ccc4c(c3)": 2056,
    "N(C)CC": 2057,
    "(OC": 2058,
    "c1ccccc1N": 2059,
    "2)c(=O)[nH]": 2060,
    "NC(=O)[C@H](CC(C)C)NC(=O)[C@H](CC(C)C)": 2061,
    "c2ccncc2": 2062,
    "c23)C": 2063,
    ".O=C(": 2064,
    "OC)cc3": 2065,
    "C1CCN(": 2066,
    "c2cc(O": 2067,
    "(C)CC(=O)N": 2068,
    "C(=O)N[C@@H](C)C(=O)N[C@@H](C)": 2069,
    "-c2nn": 2070,
    "C(N)=OCC": 2071,
    "cccnc1": 2072,
    "c4)c3": 2073,
    "2CCO": 2074,
    "[nH]ncc": 2075,
    "c4)cc": 2076,
    "(CNC": 2077,
    "C(F)(F)F)cc3)": 2078,
    "n4)": 2079,
    "c(=O)n(CC": 2080,
    "1)C2": 2081,
    "OC)c(OC)c(OC)": 2082,
    "o2)cc1": 2083,
    "[C@@]1(": 2084,
    "2Cn1": 2085,
    "nc(SC": 2086,
    "[C@H](F)": 2087,
    "OC[C@H]3O[C@@H](n4": 2088,
    "c4ccncc": 2089,
    "2)cc1F": 2090,
    "c2cccc(O)": 2091,
    "-c2ccc(F)cc": 2092,
    "c1cc(=O)": 2093,
    "c(=O)n1C": 2094,
    "[C@H](CCC(=O)O)": 2095,
    "C(=O)NC2CC": 2096,
    "(c2ccc(": 2097,
    "O=C(CC": 2098,
    "2)CC1)": 2099,
    "c3c(N": 2100,
    "c1cncc": 2101,
    "c2ccc3ncc(": 2102,
    "OP(=O)(O)": 2103,
    "Oc1cc2c(": 2104,
    "=N/": 2105,
    "c2ccnc3": 2106,
    "cc1-": 2107,
    "COc1cc2": 2108,
    "C(C(=O)O)": 2109,
    "(C)(O)": 2110,
    "c5c(": 2111,
    "Oc1ccc(-c2": 2112,
    "c(c2": 2113,
    "O[C@@H]3CO": 2114,
    "Oc1ccc(-c2n": 2115,
    "c(N)n": 2116,
    "2C(=O)N": 2117,
    "c1cn2": 2118,
    "c1nc(NC": 2119,
    "ncccc3": 2120,
    "cc(O": 2121,
    "c3ncnc4": 2122,
    "2COC": 2123,
    "Cc1ccc(C": 2124,
    "3CCNCC3)": 2125,
    "3(": 2126,
    "CCC3": 2127,
    "OCOc1cc": 2128,
    "c2ccncc2)": 2129,
    "nc(N)nc(N)": 2130,
    "c3nc(-": 2131,
    "O[C@@H](C)": 2132,
    "C(=O)N[C@H](C(=O)N[C@@H](Cc1ccccc1)": 2133,
    "c2cccc(NC(=O)": 2134,
    "oc1": 2135,
    "c1ccs": 2136,
    "4CCNCC": 2137,
    "2)CC1COc1cc": 2138,
    "[C@H]3O": 2139,
    "3)c2)CC": 2140,
    "c2cccc3ccccc2": 2141,
    "[C@H](n4": 2142,
    "n1)N1CC": 2143,
    "C(=O)N[C@H](C(=O)N[C@@H](CC(C)C)": 2144,
    "CN1CCN(C": 2145,
    "4CCN(C)CC": 2146,
    "c(=O)c(": 2147,
    "ccc(C)": 2148,
    "NC(=O)[C@@H](Cc2ccccc2)": 2149,
    "c(-c3ccc4": 2150,
    "ClCO": 2151,
    "c(-c2cccc": 2152,
    "nnc2": 2153,
    "[C@]5": 2154,
    "c2)cc1C": 2155,
    "=NO": 2156,
    "n1nc(-": 2157,
    "5CCC": 2158,
    "cn(C)": 2159,
    "n2CC": 2160,
    "3)c2=O)": 2161,
    "c1ccc(NC(=O)N": 2162,
    "cnc3[nH]": 2163,
    "[C@@H]2O)": 2164,
    "Cc1ccccc1": 2165,
    "3)ncn": 2166,
    "C(=O)NC2": 2167,
    "n1CO": 2168,
    "-c1c(": 2169,
    "1Cc1c(": 2170,
    "c1ccc(C2=N": 2171,
    "n2)cc1CC": 2172,
    "C(=O)NCCC": 2173,
    "NC(=O)CNC(=O)[C@H](C": 2174,
    "SSC[C@H](": 2175,
    ")O": 2176,
    "c4cccc(F)": 2177,
    "cncc(": 2178,
    "CCN1CCN(": 2179,
    "1CCN(c2n": 2180,
    "c2cc(OC": 2181,
    "c1ccc(C(": 2182,
    "1CCCN(": 2183,
    "(C)cn": 2184,
    "c2ccc(C)": 2185,
    "c1ccc(C(F)(F)F)cc": 2186,
    "CNC(=O)C": 2187,
    "N1CCN(CC": 2188,
    "c2ccccc2c1": 2189,
    "[C@H](CC(=O)O)": 2190,
    "c2cnn3": 2191,
    "c1cncc(-c2": 2192,
    "cccnc2)": 2193,
    "3)CC1": 2194,
    "2)cc1Cl": 2195,
    "C1CCN(C": 2196,
    "C(=O)OCO": 2197,
    "c1C)": 2198,
    "c2ncc3": 2199,
    "n4)CC": 2200,
    "3)nn1": 2201,
    "NC(=O)c2cc(": 2202,
    "C(=O)N[C@@H](Cc2ccccc2)": 2203,
    "1)O": 2204,
    "CCC1)": 2205,
    "c1ccc(CO": 2206,
    "OC)c(OC": 2207,
    "c1c2c(": 2208,
    "C(n2": 2209,
    "c(-c2ccccc2)n": 2210,
    "ccnc1": 2211,
    "(O)CN": 2212,
    ")nc(N": 2213,
    "ccc(O": 2214,
    "SCC[C@H](": 2215,
    "n1O=C(O)": 2216,
    "OC[C@@H]": 2217,
    "(C)C[C@@H]1": 2218,
    "c3ncnc(N": 2219,
    "O[C@H](": 2220,
    "[C@@H](O)[C@H](": 2221,
    "3C(=O)": 2222,
    "c(C)c1C": 2223,
    "n2cnc3c(": 2224,
    "c(-c2cc(": 2225,
    "[C@H]1O[C@@H](": 2226,
    "c(-c2ccc(C": 2227,
    "SSC[C@@H](": 2228,
    "2)cc(OC)": 2229,
    "c3ncccc3": 2230,
    "[nH]c2=O)": 2231,
    "c1cncn": 2232,
    "nc3n": 2233,
    "3)nc12": 2234,
    "[C@]2(C)": 2235,
    "1COc1cc(N": 2236,
    "OP(O)(=S)": 2237,
    "nccs": 2238,
    "C/": 2239,
    "S(=O)(=O)[O-])": 2240,
    "1CCCO": 2241,
    "NCC(=O)N": 2242,
    "c1ccc(-c2ccccc2-c2": 2243,
    "CN2CC": 2244,
    "C(=O)N[C@H](C(=O)N[C@@H](CCCCN)": 2245,
    "O4)": 2246,
    "c5ccccc4": 2247,
    "cn[nH]": 2248,
    "c3cc(C)": 2249,
    "C(=O)Nc1ccc(": 2250,
    "CC1O=C(": 2251,
    "CCN(C)C)": 2252,
    "2CCCN(C(=O)": 2253,
    "C(=O)NCCCC": 2254,
    "n2c1": 2255,
    "n(-c2": 2256,
    "c4cccc5": 2257,
    "3)cc(": 2258,
    "Br.": 2259,
    "n1-c1ccccc1": 2260,
    "2)CC1CC(C)": 2261,
    "CC[C@@H]1": 2262,
    "3)cc2)cc1": 2263,
    "c(OC)c1": 2264,
    "n2)CC1": 2265,
    "c1-c1cc": 2266,
    "nc(=O)": 2267,
    "Nc1nccc(": 2268,
    "[C@@H]3O)": 2269,
    "c5ccccc5)": 2270,
    "c(CO)": 2271,
    "1C2CC": 2272,
    "CC(C)C": 2273,
    "c1cc(C(=O)N2CC": 2274,
    "o1CC": 2275,
    "c2ccccc21C": 2276,
    "[C@@H]1CCCN": 2277,
    "C1=OC": 2278,
    "[C@@H]2C)": 2279,
    "c2ccccc2-": 2280,
    "(CNC(=O)": 2281,
    "c1ccc(CCN": 2282,
    "c3cc(N": 2283,
    "2)C3)": 2284,
    "cc5": 2285,
    "3)C2)cc1": 2286,
    "ccc(C#N": 2287,
    "c2nc(C)": 2288,
    "[nH]c(-": 2289,
    "c1ncccc": 2290,
    ")cc1OCC": 2291,
    "2)nn": 2292,
    "C(=O)CN": 2293,
    ".O=C(O)C(F)(F)FC": 2294,
    "c3ccc(Cl)c(Cl)": 2295,
    "[C@@H](OC": 2296,
    "c3)cc2": 2297,
    "c1ccc2c(c1)C": 2298,
    "C(=O)N[C@@H](CCSC)": 2299,
    "c3ccncc3)": 2300,
    "ccc(OC": 2301,
    "C(O)C(O)": 2302,
    "c3cs": 2303,
    "c2O": 2304,
    "[C@H]1CC[C@H](CC": 2305,
    "C2(CC1)C": 2306,
    "6)CC": 2307,
    "3CCOC": 2308,
    "CC1(": 2309,
    "=N)": 2310,
    "O)ccc2": 2311,
    "n1cncn": 2312,
    "[C@@H]2CN": 2313,
    "c1-c1ccccc1": 2314,
    "c2ccccc21": 2315,
    "CC2)cc1": 2316,
    "nc6": 2317,
    "n1nc(": 2318,
    "CCC1CC": 2319,
    "C(NC": 2320,
    "(C)(C)C": 2321,
    "[C@H]1CC[C@H](": 2322,
    "c1cc2c(cc1": 2323,
    "C(=O)N[C@@H](CCC(=O)O)C(=O)N[C@@H](CCC(=O)O)": 2324,
    "nc32)": 2325,
    "c3)cn": 2326,
    "NC(=O)C1CC": 2327,
    "4O": 2328,
    "3)n1": 2329,
    "c(F)c1": 2330,
    "O[C@@H]7": 2331,
    "-c4ccc(": 2332,
    "c1ccccc1)CC": 2333,
    "CCC1(": 2334,
    "NC(=O)[C@H]1CCCN1C(=O)": 2335,
    "C(=O)N[C@@H](CC(C)C)C(=O)N[C@@H](CCCNC(=N)N)": 2336,
    "2CCOC": 2337,
    "c1cccc(-c2ccc(": 2338,
    "c3cccc(-": 2339,
    "c2)o": 2340,
    "O=C(Nc1n": 2341,
    "c2nc": 2342,
    "C(C)(C)O)": 2343,
    "c3ccnc(": 2344,
    "C(=O)NC(": 2345,
    "2C[C@@H]3": 2346,
    "n4cn": 2347,
    "S(N)(=O)=O)cc": 2348,
    "[N+](=O)": 2349,
    "2)cc1CN": 2350,
    "2Cc1n": 2351,
    "cccc(F)": 2352,
    "CC2CC": 2353,
    "1CN1C(=O)": 2354,
    "2)c2ccccc2": 2355,
    ")cc12": 2356,
    "CCN(C)C": 2357,
    "3)C2": 2358,
    "cn(": 2359,
    "c2cc(Cl)": 2360,
    "2CCC1": 2361,
    "c1cccc(OC)": 2362,
    "c1Nc1n": 2363,
    "4)cc3)n": 2364,
    "c23)CC": 2365,
    "c1ccc(C#N": 2366,
    "c(Cl)c3)": 2367,
    "c(=O)n3": 2368,
    "CC4)n": 2369,
    "C(=O)NC1CC": 2370,
    "4)NC(=O)[C@H](CCCCN)": 2371,
    "c2cc1OC": 2372,
    "NC(=O)[C@H](CCCCN)NC(=O)[C@H](CCCCN)": 2373,
    "NC(=O)[C@H](Cc2c[nH]c3ccccc23)": 2374,
    "cc(Cl)ccc3": 2375,
    "c1nn2": 2376,
    "S(=O)(=O)c1ccc(": 2377,
    "O)C(O)": 2378,
    "[C@@H]1CN": 2379,
    "NC(=O)[C@H](CC(C)C)NC(=O)[C@H](C": 2380,
    "C(=O)N[C@@H](CC(N)=O)C(=O)N[C@H](": 2381,
    "1CN(C)C(=O)": 2382,
    "CCCC(=O)N": 2383,
    "[C@@H](F)": 2384,
    "1CCCN(C": 2385,
    "n(C)c(=O)": 2386,
    "OC)cc(N": 2387,
    "NC(=O)[C@H](Cc1cnc[nH]1)": 2388,
    "cc(-c3ccc(": 2389,
    "c2ccnc(N": 2390,
    "c1C1CC": 2391,
    "OCCOCCN": 2392,
    "c1cccnc1)": 2393,
    "c(F)c3)": 2394,
    "n3cnc4": 2395,
    "C(C)CO": 2396,
    "NC(=O)[C@H](CCCNC(=N)N)NC(=O)[C@H](C": 2397,
    "cnn3": 2398,
    "c1ccc(OC)": 2399,
    "O)cc3)": 2400,
    "cncc": 2401,
    "Br)cc1": 2402,
    "c3c(Cl)": 2403,
    "n1c(": 2404,
    "[C@H](C)N": 2405,
    "CC4)": 2406,
    ".ClCO": 2407,
    "c1ccnc(N": 2408,
    "c1ncnc2": 2409,
    "4)c3)n": 2410,
    "Cl)N": 2411,
    "s2)c1": 2412,
    "[C@@H](C)O)[C@@H](C)O)": 2413,
    "CC(=O)O)cc": 2414,
    "cc2F)": 2415,
    "n(-": 2416,
    "c3ccccc32)": 2417,
    "nc2c(": 2418,
    "C[C@H]1C": 2419,
    "1COc1ccc(-c2": 2420,
    "O=C(N[C@H]1CC": 2421,
    "c2C1": 2422,
    "NC(=O)CN(CCNC(=O)CN(CC": 2423,
    "2CC2)n": 2424,
    "c1-c1cn": 2425,
    "c2c3c(": 2426,
    "2CCCN(C": 2427,
